[
  {
    "title": "Your Learning Persona",
    "description": "Hello Aarthi, as a Persistent Hiker, you approach SAT® prep with steady consistency and a calm mindset that values balance and mental well-being. You excel at maintaining emotional stability and thoughtful study habits but may shy away from challenges that disrupt your inner harmony. Embracing small, manageable challenges will help you push beyond comfort without sacrificing your preferred steady pace."
  },
  {
    "title": "Your SAT® Practice Snapshot",
    "description": "Your current SAT® scores show strong performance with a Reading & Writing score of 730 and a Math score of 790, totaling 1520 against your goal of 1550. Your reading accuracy is solid, and your math accuracy is near perfect, reflecting consistent effort and skill. You are close to your target, so focusing on targeted refinements will help you close the remaining gap efficiently."
  },
  {
    "title": "What This Means For You",
    "description": "Your Persistent Hiker mindset supports steady progress but may limit pushing into more demanding challenges. Academically, your strength lies in high accuracy within 'Information and Ideas' and flawless execution in 'Algebra', aligning with your calm and deliberate approach. Growth is needed in 'Craft and Structure' where deeper engagement will enhance your reading precision, and in 'Advanced Math' where embracing complexity can raise your score. Your goal score is within reach if you balance comfort with strategic effort to refine these areas."
  },
  {
    "title": "Your Study Plan: Based on You",
    "description": [
      {
        "title": "Summary",
        "description": "Your current total SAT® score is 1520 with a goal of 1550, and your study timeline spans from Jun 03, 2025 to Aug 07, 2025. Your primary focus areas will be 'Craft and Structure', 'Advanced Math', and 'Information and Ideas' to address key opportunities for improvement. Your study approach will leverage your steady, balanced learning style by introducing micro-challenges and gamified progress to maintain harmony while encouraging growth. The plan unfolds in Foundation, Elevation, and Peak phases, designed to build confidence and sharpen skills progressively toward your goal."
      },
      {
        "title": "Reading & Writing Strategies",
        "description": [
          "1. 'Craft and Structure': Approach this domain by gradually increasing the complexity of passages and questions, allowing you to stretch your skills without disrupting your steady study rhythm.",
          "2. 'Information and Ideas' and 'Standard English Conventions': Use reflective review and visual feedback techniques to deepen comprehension and reinforce accuracy, aligning with your thoughtful and deliberate learning style.",
          "3. 'Expression of Ideas': Maintain and refine this strength through timed practice that respects your preference for calm environments, ensuring steady progress without added pressure."
        ]
      },
      {
        "title": "Math Strategies",
        "description": [
          "1. 'Advanced Math': Engage with progressively challenging problems in manageable segments to build confidence while expanding your problem-solving range within your balanced study framework.",
          "2. 'Algebra' and 'Geometry and Trigonometry': Use spaced repetition and gamified drills to enhance fluency, supporting your preference for sustainable growth without overwhelming intensity.",
          "3. 'Problem-Solving and Data Analysis': Focus on pattern recognition and error tracking through personalized simulations that reinforce retention while respecting your steady pace."
        ]
      },
      {
        "title": "Study Plan Phases",
        "description": {
          "Foundation": {
            "Date": "Jun 03, 2025 - Jun 24, 2025",
            "Reading & Writing": "Concentrate on 'Craft and Structure' by introducing micro-challenges that encourage deeper engagement without disrupting your calm study flow.",
            "Math": "Target 'Advanced Math' with paced conceptual reviews and manageable problem sets that align with your preference for steady effort."
          },
          "Elevation": {
            "Date": "Jun 25, 2025 - Jul 16, 2025",
            "Reading & Writing": "Develop skills in 'Information and Ideas' and 'Standard English Conventions' through reflective drills and visual feedback to leverage your thoughtful approach.",
            "Math": "Strengthen 'Algebra' and 'Geometry and Trigonometry' using spaced repetition and gamified practice to maintain motivation and build fluency."
          },
          "Peak": {
            "Date": "Jul 17, 2025 - Aug 07, 2025",
            "Reading & Writing": "Reinforce 'Expression of Ideas' with timed simulations and personalized stress management techniques to sustain calm focus under test conditions.",
            "Math": "Refine 'Problem-Solving and Data Analysis' through speed-building exercises and pattern review that support retention and error awareness."
          }
        }
      },
      {
        "title": "Weekly Schedule",
        "description": [
          "**Week 1 (Jun 03, 2025 – Jun 09, 2025):**",
          "Tue: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Wed: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Thu: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Fri: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Sat: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Sun: focus area: Math Rank 1 domain - duration 30 minutes Phase: Foundation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Foundation.",
          "",
          "**Week 2 (Jun 10, 2025 – Jun 16, 2025):**",
          "Tue: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Wed: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Thu: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Fri: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Sat: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Sun: focus area: Math Rank 1 domain - duration 30 minutes Phase: Foundation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Foundation.",
          "",
          "**Week 3 (Jun 17, 2025 – Jun 23, 2025):**",
          "Tue: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Wed: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Thu: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Fri: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Sat: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Sun: focus area: Math Rank 1 domain - duration 30 minutes Phase: Foundation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Foundation.",
          "",
          "**Week 4 (Jun 24, 2025 – Jun 30, 2025):**",
          "Tue: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Wed: focus area: Math Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Sat: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Sun: focus area: Math Rank 2 domain - duration 30 minutes Phase: Elevation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Elevation.",
          "",
          "**Week 5 (Jul 01, 2025 – Jul 07, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Thu: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Fri: focus area: Math Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Sat: focus area: RW Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Sun: focus area: Math Rank 3 domain - duration 30 minutes Phase: Elevation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Elevation.",
          "",
          "**Week 6 (Jul 08, 2025 – Jul 14, 2025):**",
          "Tue: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Wed: focus area: Math Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Sat: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Sun: focus area: Math Rank 2 domain - duration 30 minutes Phase: Elevation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Elevation.",
          "",
          "**Week 7 (Jul 15, 2025 – Jul 21, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Sat: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Sun: focus area: Math Rank 3 domain - duration 30 minutes Phase: Peak.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Peak.",
          "",
          "**Week 8 (Jul 22, 2025 – Jul 28, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Sat: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Sun: focus area: Math Rank 3 domain - duration 30 minutes Phase: Peak.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Peak.",
          "",
          "**Week 9 (Jul 29, 2025 – Aug 04, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Sat: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Sun: focus area: Math Rank 3 domain - duration 30 minutes Phase: Peak.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Peak.",
          "",
          "**Week 10 (Aug 05, 2025 – Aug 07, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: Flex - duration 60 minutes Phase: Peak."
        ]
      },
      {
        "title": "Study Tips",
        "description": [
          "1. 'Craft and Structure': Gradually increase challenge levels in this domain to gently push beyond comfort zones, turning steady effort into measurable progress.",
          "2. 'Advanced Math': Break complex problems into smaller parts and reward incremental wins to maintain balance while expanding your problem-solving skills.",
          "3. 'Information and Ideas': Use reflective review sessions to deepen understanding, aligning with your thoughtful and deliberate learning style for sustained growth.",
          "4. 'Standard English Conventions': Incorporate visual feedback during practice to reinforce accuracy without disrupting your calm study environment.",
          "5. 'Expression of Ideas': Maintain steady practice with timed exercises that respect your preference for low-stress conditions while refining your skills."
        ]
      }
    ]
  },
  {
    "title": "Want to Go Further?",
    "description": "Aarthi, your steady and balanced approach to SAT® prep reflects a mature understanding of sustainable growth. Your strengths in maintaining calm focus and high accuracy provide a solid foundation to build on. Addressing areas like 'Craft and Structure' and 'Advanced Math' with small, manageable challenges will help you bridge the gap to your goal. Embracing these micro-challenges within your preferred pace will deepen your skills without disrupting your equilibrium. Sherpal provides personalized insights, real-time feedback, and structured planning tailored to your thoughtful learning style, supporting your steady progress toward success."
  },
  {
    "title": "Footer",
    "description": "Safe harbor The scores, assessments, and recommendations provided in this report are for informational purposes only and do not constitute professional educational, psychological, or legal advice. Current performance is not necessarily indicative of actual or future results, as test-day conditions and individual circumstances may vary. While care has been taken in the preparation of this material, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, or reliability of the information presented. Any reliance you place on such information is strictly at your own risk. We accept no liability for any loss or damage arising from the use of this report. © 2025 Sthirah Inc. | Confidential & Proprietary - For internal Use Only"
  }
]