[
  {
    "title": "Your Learning Persona",
    "description": "Hello Aarthi, as a Persistent Hiker, you approach SAT® prep with steady consistency and emotional balance, valuing sustainable progress over pressure. You remain calm under stress and prioritize harmony, which supports thoughtful learning. To advance, gently challenge yourself beyond comfort zones to avoid plateaus and deepen growth."
  },
  {
    "title": "Your SAT® Practice Snapshot",
    "description": "Your current SAT® performance shows strong results with a Reading & Writing score of 730 and a Math score of 790, totaling 1520 against your goal of 1550. Your reading accuracy is solid, and your math accuracy is excellent, reflecting careful and precise work. You are close to your target, so refining specific skills will help you close the gap efficiently."
  },
  {
    "title": "What This Means For You",
    "description": "Your Persistent Hiker mindset supports steady progress but may limit pushing through tougher challenges. Academically, your strength lies in high accuracy within 'Information and Ideas' and flawless performance in 'Algebra', reflecting your calm and deliberate approach. Growth is needed in 'Craft and Structure' to deepen analytical reading and in 'Advanced Math' to maintain precision under pressure, aligning with your tendency to avoid intense academic strain. Your goal score is within reach if you balance comfort with targeted effort."
  },
  {
    "title": "Your Study Plan: Based on You",
    "description": [
      {
        "title": "Summary",
        "description": "Your current SAT® total score is 1520 with a goal of 1550, and your study timeline spans from Jun 03, 2025 to Aug 07, 2025. Your primary focus areas will be 'Craft and Structure', 'Advanced Math', and 'Information and Ideas' to address key growth points. Your study approach will emphasize steady, manageable challenges that respect your preference for balance and emotional stability while encouraging gradual skill expansion. The plan unfolds in Foundation, Elevation, and Peak phases, designed to build confidence and sharpen skills progressively toward your goal."
      },
      {
        "title": "Reading & Writing Strategies",
        "description": [
          "1. 'Craft and Structure': Approach this domain by introducing small, deliberate challenges that stretch your analytical skills without overwhelming your study rhythm, allowing you to engage deeply while maintaining your calm focus.",
          "2. 'Information and Ideas' and 'Standard English Conventions': Use reflective review and visual feedback methods to reinforce comprehension and grammar, leveraging your thoughtful nature to solidify understanding through measured practice.",
          "3. 'Expression of Ideas': Maintain and refine this skill by integrating timed writing exercises that encourage steady progress, balancing challenge with your preference for harmony in learning."
        ]
      },
      {
        "title": "Math Strategies",
        "description": [
          "1. 'Advanced Math': Gradually increase problem complexity in this domain to gently push your limits, using structured pacing that aligns with your steady learning style to build confidence without disrupting balance.",
          "2. 'Algebra' and 'Geometry and Trigonometry': Reinforce fluency through spaced repetition and gamified drills that provide clear milestones, helping you engage actively while preserving your emotional stability.",
          "3. 'Problem-Solving and Data Analysis': Sustain your high accuracy by focusing on pattern recognition and error tracking in practice simulations, supporting retention with manageable, focused sessions."
        ]
      },
      {
        "title": "Study Plan Phases",
        "description": {
          "Foundation": {
            "Date": "Jun 03, 2025 - Jun 24, 2025",
            "Reading & Writing": "Concentrate on 'Craft and Structure' with study sessions designed to introduce micro-challenges that encourage active engagement while respecting your need for a stress-free pace.",
            "Math": "Target 'Advanced Math' by pacing practice to build conceptual understanding steadily, incorporating formats that support your preference for calm, deliberate learning."
          },
          "Elevation": {
            "Date": "Jun 25, 2025 - Jul 16, 2025",
            "Reading & Writing": "Focus on 'Information and Ideas' and 'Standard English Conventions' through reflective drills and visual feedback techniques that align with your thoughtful and balanced approach.",
            "Math": "Strengthen 'Algebra' and 'Geometry and Trigonometry' using spaced repetition and gamified exercises to maintain motivation and deepen fluency without disrupting your inner balance."
          },
          "Peak": {
            "Date": "Jul 17, 2025 - Aug 07, 2025",
            "Reading & Writing": "Reinforce 'Expression of Ideas' with timed simulations and personalized stress management strategies that support your calm demeanor during test conditions.",
            "Math": "Refine 'Problem-Solving and Data Analysis' by focusing on speed-building and error tracking in practice rounds, ensuring retention and confidence as you approach test day."
          }
        }
      },
      {
        "title": "Weekly Schedule",
        "description": [
          "**Week 1 (Jun 03, 2025 – Jun 09, 2025):**",
          "Tue: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Wed: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Thu: focus area: RW Rank 2 domain - duration 60 minutes Phase: Foundation.",
          "Fri: focus area: Math Rank 2 domain - duration 60 minutes Phase: Foundation.",
          "Sat: focus area: RW Rank 3 domain - duration 60 minutes Phase: Foundation.",
          "Sun: focus area: Math Rank 3 domain - duration 30 minutes Phase: Foundation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Foundation.",
          "",
          "**Week 2 (Jun 10, 2025 – Jun 16, 2025):**",
          "Tue: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Wed: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Thu: focus area: RW Rank 2 domain - duration 60 minutes Phase: Foundation.",
          "Fri: focus area: Math Rank 2 domain - duration 60 minutes Phase: Foundation.",
          "Sat: focus area: RW Rank 3 domain - duration 60 minutes Phase: Foundation.",
          "Sun: focus area: Math Rank 3 domain - duration 30 minutes Phase: Foundation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Foundation.",
          "",
          "**Week 3 (Jun 17, 2025 – Jun 23, 2025):**",
          "Tue: focus area: RW Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Wed: focus area: Math Rank 1 domain - duration 60 minutes Phase: Foundation.",
          "Thu: focus area: RW Rank 2 domain - duration 60 minutes Phase: Foundation.",
          "Fri: focus area: Math Rank 2 domain - duration 60 minutes Phase: Foundation.",
          "Sat: focus area: RW Rank 3 domain - duration 60 minutes Phase: Foundation.",
          "Sun: focus area: Math Rank 3 domain - duration 30 minutes Phase: Foundation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Foundation.",
          "",
          "**Week 4 (Jun 24, 2025 – Jun 30, 2025):**",
          "Tue: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Wed: focus area: Math Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Sat: focus area: RW Rank 1 domain - duration 60 minutes Phase: Elevation.",
          "Sun: focus area: Math Rank 1 domain - duration 30 minutes Phase: Elevation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Elevation.",
          "",
          "**Week 5 (Jul 01, 2025 – Jul 07, 2025):**",
          "Tue: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Wed: focus area: Math Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Sat: focus area: RW Rank 1 domain - duration 60 minutes Phase: Elevation.",
          "Sun: focus area: Math Rank 1 domain - duration 30 minutes Phase: Elevation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Elevation.",
          "",
          "**Week 6 (Jul 08, 2025 – Jul 14, 2025):**",
          "Tue: focus area: RW Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Wed: focus area: Math Rank 2 domain - duration 60 minutes Phase: Elevation.",
          "Thu: focus area: RW Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Fri: focus area: Math Rank 3 domain - duration 60 minutes Phase: Elevation.",
          "Sat: focus area: RW Rank 1 domain - duration 60 minutes Phase: Elevation.",
          "Sun: focus area: Math Rank 1 domain - duration 30 minutes Phase: Elevation.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Elevation.",
          "",
          "**Week 7 (Jul 15, 2025 – Jul 21, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: RW Rank 1 domain - duration 60 minutes Phase: Peak.",
          "Fri: focus area: Math Rank 1 domain - duration 60 minutes Phase: Peak.",
          "Sat: focus area: RW Rank 2 domain - duration 60 minutes Phase: Peak.",
          "Sun: focus area: Math Rank 2 domain - duration 30 minutes Phase: Peak.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Peak.",
          "",
          "**Week 8 (Jul 22, 2025 – Jul 28, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: RW Rank 1 domain - duration 60 minutes Phase: Peak.",
          "Fri: focus area: Math Rank 1 domain - duration 60 minutes Phase: Peak.",
          "Sat: focus area: RW Rank 2 domain - duration 60 minutes Phase: Peak.",
          "Sun: focus area: Math Rank 2 domain - duration 30 minutes Phase: Peak.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Peak.",
          "",
          "**Week 9 (Jul 29, 2025 – Aug 04, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: RW Rank 1 domain - duration 60 minutes Phase: Peak.",
          "Fri: focus area: Math Rank 1 domain - duration 60 minutes Phase: Peak.",
          "Sat: focus area: RW Rank 2 domain - duration 60 minutes Phase: Peak.",
          "Sun: focus area: Math Rank 2 domain - duration 30 minutes Phase: Peak.",
          "Mon: focus area: Flex - duration 60 minutes Phase: Peak.",
          "",
          "**Week 10 (Aug 05, 2025 – Aug 07, 2025):**",
          "Tue: focus area: RW Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Wed: focus area: Math Rank 3 domain - duration 60 minutes Phase: Peak.",
          "Thu: focus area: RW Rank 1 domain - duration 60 minutes Phase: Peak."
        ]
      },
      {
        "title": "Study Tips",
        "description": [
          "1. 'Craft and Structure': Introduce small, manageable challenges in this domain to gently expand your analytical skills, aligning with your preference for steady, stress-free progress.",
          "2. 'Advanced Math': Use structured pacing and incremental difficulty to build confidence without disrupting your emotional balance, turning complexity into achievable milestones.",
          "3. 'Information and Ideas': Leverage your reflective thinking by reviewing passages visually and thoughtfully, which supports deeper comprehension without pressure.",
          "4. 'Standard English Conventions': Reinforce grammar skills through consistent, measured practice that fits your calm and deliberate learning style, avoiding overwhelming intensity.",
          "5. 'Expression of Ideas': Incorporate timed exercises that encourage steady refinement, balancing challenge with your natural preference for harmony in preparation."
        ]
      }
    ]
  },
  {
    "title": "Want to Go Further?",
    "description": "Aarthi, your steady and balanced approach to SAT® prep reflects a mature understanding of sustainable growth. Your strengths in thoughtful analysis and precision position you well to close the small gap to your goal. Embracing micro-challenges will help you stretch without disrupting your inner calm, turning discomfort into meaningful progress. Sherpal provides personalized insights, real-time feedback, and structured planning tailored to your learning style, supporting your journey with clarity and focus."
  },
  {
    "title": "Footer",
    "description": "Safe harbor The scores, assessments, and recommendations provided in this report are for informational purposes only and do not constitute professional educational, psychological, or legal advice. Current performance is not necessarily indicative of actual or future results, as test-day conditions and individual circumstances may vary. While care has been taken in the preparation of this material, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, or reliability of the information presented. Any reliance you place on such information is strictly at your own risk. We accept no liability for any loss or damage arising from the use of this report. © 2025 Sthirah Inc. | Confidential & Proprietary - For internal Use Only"
  }
]