{
	"user": {
		"user_id": "786be4c1-e143-47e2-84a2-8f47f3d41382",
		"first_name": "Aarthi",
		"last_name": "Kondra",
		"email": "njkondras@gmail.com",
		"grade": "10th",
		"goal_score": 1550,
		"planned_sat_date": "2025-08-07",
		"persona_id": "92a0b46a-9447-42bb-8833-6165a11d8c7a",
		"has_paid_access": false
	},
	"persona": {
		"persona_id": "92a0b46a-9447-42bb-8833-6165a11d8c7a",
		"persona_name": "Persistent Hiker",
		"key_strengths": [
			"Persistent Hikers are balanced learners who prioritize well-being, emotional stability, and sustainable growth. They often take a steady, stress-free approach to studying, valuing long-term consistency over short-term pressure. These students are self-aware and mature, often prioritizing mental health without losing sight of their academic goals. They are calm in the face of academic stress and prefer harmony in their learning environments. They are thoughtful and deliberate, often serving as mediators or supportive figures in group settings."
		],
		"areas_of_improvement": [
			"Because they avoid stress and conflict, Persistent Hikers may also avoid academic pressure or challenges that stretch their limits. They may coast through topics that require more active struggle, choosing comfort over growth. This can lead to plateaus in performance and a sense of underachievement, even when the potential is high. They may also resist competition or intense prep methods, feeling that they disrupt their inner balance."
		],
		"growth_strategies": "Encourage micro-challenges that gradually push the student beyond their comfort zone. Gamify the learning process with levels of difficulty and reward progress with recognition and small wins. Frame challenges as opportunities for growth, not confrontation. Help them reflect on the difference between peace and complacency—true balance comes from knowing when to push. Pair them with slightly more intense peers for occasional group challenges to boost motivation and momentum.",
		"famous_person": "Keanu Reeves",
		"inspirational_story": "Keanu Reeves is a classic Persistent Hiker. Known for his calm demeanor, empathy, and grounded approach to fame, Reeves has built a career of consistent excellence without the drama often associated with Hollywood. He’s respected not just for his talent, but for his humility and resilience. Reeves faced enormous personal losses early in his life, including the death of his best friend and his partner. Despite this, he continued working, learning, and supporting others quietly. He avoids media frenzy and instead focuses on meaningful work. While he may not chase awards or compete for the spotlight, his dedication has led to cult classics like The Matrix and John Wick franchises.Persistent Hikers can see in Reeves a reflection of themselves: success doesn’t always require noise. But when challenge arises, facing it with quiet determination and growth-mindedness can lead to deeply meaningful success.",
		"quote": "Strength doesn’t always roar—sometimes it whispers, ‘try again tomorrow."
	},
	"sat_report": {
		"user_id": "786be4c1-e143-47e2-84a2-8f47f3d41382",
		"test_id": "Ascent01b",
		"date_taken": "2025-03-11",
		"scores": { "reading_writing": 730, "math": 790, "total": 1520 },
		"accuracy": [
			{
				"subject": "reading_writing",
				"accuracy": 0.89,
				"domain_accuracy": [
					{ "domain": "Craft and Structure", "accuracy": 0.82 },
					{ "domain": "Information and Ideas", "accuracy": 0.92 },
					{
						"domain": "Standard English Conventions",
						"accuracy": 0.92
					},
					{ "domain": "Expression of Ideas", "accuracy": 0.91 }
				]
			},
			{
				"subject": "math",
				"accuracy": 0.98,
				"domain_accuracy": [
					{ "domain": "Algebra", "accuracy": 1.0 },
					{ "domain": "Advanced Math", "accuracy": 0.93 },
					{
						"domain": "Problem-Solving and Data Analysis",
						"accuracy": 1.0
					},
					{ "domain": "Geometry and Trigonometry", "accuracy": 1.0 }
				]
			}
		],
		"time_spent_minutes": { "reading_writing": 24, "math": 45 },
		"test_results_id": "20e5d70b-39b5-41d8-9592-efe88a05dda0",
		"read_write_domain_accuracy": [
			{ "domain": "Craft and Structure", "accuracy": 0.82 },
			{ "domain": "Information and Ideas", "accuracy": 0.92 },
			{ "domain": "Standard English Conventions", "accuracy": 0.92 },
			{ "domain": "Expression of Ideas", "accuracy": 0.91 }
		],
		"math_domain_accuracy": [
			{ "domain": "Algebra", "accuracy": 1.0 },
			{ "domain": "Advanced Math", "accuracy": 0.93 },
			{ "domain": "Problem-Solving and Data Analysis", "accuracy": 1.0 },
			{ "domain": "Geometry and Trigonometry", "accuracy": 1.0 }
		]
	}
}
