{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context' questions, leverage your natural attention to detail by annotating key context clues—such as definitions, contrasts, and examples—directly in the passage. Commit to quick, timed drills where you select meanings based solely on passage context to build trust in your instincts and reduce second-guessing.",
        "For 'Command of Evidence' questions, practice pairing your answer with precise textual support by underlining evidence immediately after answering. Use timed exercises to reinforce decisiveness, then review your choices to celebrate correct matches and learn from missteps without dwelling on errors.",
        "To master 'Form, Structure, and Sense,' create brief outlines of passage organization during practice to map the logical flow. Challenge yourself to identify paragraph purposes under timed conditions, reinforcing your analytical strengths while training your confidence to commit to structural interpretations swiftly.",
        "When studying 'Nonlinear Functions,' actively sketch graphs before solving problems to visualize behavior and reduce hesitation. Incorporate timed problem sets that require you to commit to solutions quickly, then review errors constructively to build accuracy and confidence in handling complex functions.",
        "For 'Linear Functions' in word problems, develop a habit of translating scenarios into equations within a strict time limit. Use structured templates to identify slopes and intercepts rapidly, pairing this with positive feedback loops that track your growing speed and precision.",
        "In solving 'Nonlinear Equations and Systems,' focus on mastering substitution and discriminant interpretation through repetitive, timed drills. After each session, reflect briefly on your accuracy streaks to reinforce self-trust and maintain momentum, avoiding over-analysis of occasional mistakes."
    ]
}