{
    "title": "Elevation Phase",
    "description": [
        {
            "title": "Weekly Goals",
            "description": "Achieve measurable improvement in accuracy and reasoning for mid-level and advanced Math and Reading & Writing skills, specifically targeting reduction of careless errors and hesitation under timed conditions. Demonstrate increased speed and confidence in decision-making drills with limited time per question. Complete full-length practice tests with fewer unanswered questions, reflecting stronger cognitive flexibility and strategic pacing. Develop consistent post-practice reflection habits to reinforce correct instincts and adapt strategies for sustained progress."
        },
        {
            "title": "Skill Areas",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": "Text Structure and Purpose, Boundaries, Command of Evidence - Textual"
                },
                {
                    "title": "Math",
                    "description": "Linear functions, Right triangles and trigonometry, Lines, angles, and triangles, Area and volume, One-variable data: Distributions and measures of center and spread"
                }
            ]
        },
        {
            "title": "Practice Methods",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": {
                        "Text Structure and Purpose": "Engage in timed practice sets focusing on complex passages where you identify and explain the author’s organizational choices and purpose, followed by a brief written reflection on how understanding the 'why' behind structure improved your answer speed and accuracy.",
                        "Boundaries": "Practice mastering the most difficult boundary questions under strict time limits, using targeted drills that require quick identification of passage limits and transitions, then review errors immediately to confirm when your initial instincts were correct to build trust in your decision-making.",
                        "Command of Evidence - Textual": "Complete challenging evidence-based questions with a countdown timer per question to simulate test pressure, then journal post-practice about moments you hesitated but were correct, reinforcing confidence in partial information and strategic answer commitment."
                    }
                },
                {
                    "title": "Math",
                    "description": {
                        "Linear functions": "Translate word problems into linear equations under timed conditions, focusing on identifying slope and intercept quickly, then explain in writing how the equation models the scenario to deepen conceptual understanding and speed.",
                        "Right triangles and trigonometry": "Work through foundational right triangle problems by drawing diagrams and labeling sides and angles, practicing sine, cosine, and tangent ratios with a calculator, emphasizing accuracy over speed to solidify core concepts before timed drills.",
                        "Lines, angles, and triangles": "Solve advanced geometry problems involving congruence and similarity with a focus on visualizing and sketching figures, then write brief justifications for each step to connect conceptual mastery with strategic problem-solving under moderate time pressure.",
                        "Area and volume": "Complete challenging area and volume problems with a timer to improve speed and accuracy, including unit conversion drills, followed by a review session to identify and correct careless mistakes in formula application.",
                        "One-variable data: Distributions and measures of center and spread": "Practice calculating mean, median, range, and IQR from data sets with simple problems, then interpret graphical data representations calmly to build foundational understanding before increasing complexity."
                    }
                }
            ]
        },
        {
            "title": "Weekly Structure",
            "description": "Each weekday balances focused dual-skill practice, pairing one Math and one Reading & Writing skill per session. Begin the week targeting your weakest skills to build momentum and confidence, midweek shift to moderate skills to reinforce and layer complexity, and reserve Fridays for comprehensive review and error analysis to adapt strategies. Saturdays are dedicated to one full-length SAT practice test under timed conditions, followed by an in-depth review to identify patterns in mistakes and hesitation. Sundays serve as a Flex Day to rest, reflect, and recalibrate for the week ahead."
        },
        {
            "title": "Flex Day Activities",
            "description": "Engage in reflective journaling focused on moments when you trusted your instincts and succeeded, reinforcing confidence and reducing fear of error. Experiment with new study tools or techniques that stimulate intellectual curiosity without pressure, such as concept mapping or discussion with peers. Tackle mixed-skill challenge sets at a relaxed pace to maintain cognitive flexibility. Incorporate mindfulness or light physical activity to reset mental energy. Set clear, purpose-driven goals for the upcoming week to maintain motivation aligned with your thoughtful learning style."
        }
    ]
}