{
    "title": "Elevation Phase",
    "description": [
        {
            "title": "Weekly Goals",
            "description": "Aim to increase accuracy and reasoning speed in both Math and Reading & Writing by focusing on second-tier skills with moderate time pressure. Reduce careless errors through deliberate practice and strategic review cycles. Demonstrate measurable improvement in interpreting complex texts and solving multi-step math problems. Maintain steady progress by meeting short-term goals and reflecting weekly on performance to adapt study strategies effectively."
        },
        {
            "title": "Skill Areas",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": "Rhetorical Synthesis, Inferences, Text Structure and Purpose"
                },
                {
                    "title": "Math",
                    "description": "Ratios, rates, proportional relationships, and units, Systems of two linear equations in two variables, Linear equations in one variable, Area and volume, Lines, angles, and triangles"
                }
            ]
        },
        {
            "title": "Practice Methods",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": {
                        "Rhetorical Synthesis": "Engage in timed practice sets of challenging synthesis questions that require integrating multiple viewpoints from paired passages, followed by reflective journaling on reasoning paths and error patterns to deepen conceptual connections and reinforce mastery through trial and error.",
                        "Inferences": "Complete targeted inference exercises under moderate time constraints that emphasize drawing conclusions from subtle textual clues, then review mistakes to identify reasoning gaps and adjust interpretive strategies for sustained accuracy.",
                        "Text Structure and Purpose": "Master complex question types by outlining passage structures and author intents during timed drills, focusing on speed optimization and strategic elimination, while tracking progress weekly to build consistent expertise."
                    }
                },
                {
                    "title": "Math",
                    "description": {
                        "Ratios, rates, proportional relationships, and units": "Solve multi-step word problems involving ratios and unit conversions under timed conditions, explicitly writing out units and conversion factors to avoid careless errors, and review solutions to refine dimensional analysis skills.",
                        "Systems of two linear equations in two variables": "Practice solving diverse systems using substitution and elimination methods with increasing complexity and time pressure, verifying solutions by substitution, and reflecting on errors to improve procedural fluency and speed.",
                        "Linear equations in one variable": "Work through advanced linear equations and inequalities problems with strict time limits, emphasizing step-by-step isolation of variables and careful sign management, followed by error analysis to reinforce accuracy and mastery.",
                        "Area and volume": "Tackle challenging geometry problems involving composite figures and unit conversions under timed practice, drawing diagrams and labeling dimensions clearly, then review mistakes to solidify formula application and spatial reasoning.",
                        "Lines, angles, and triangles": "Engage in timed exercises that require proving triangle congruence or similarity and solving angle relationships, incorporating diagram annotation and logical reasoning, with post-practice reflection to deepen understanding and reduce oversight."
                    }
                }
            ]
        },
        {
            "title": "Weekly Structure",
            "description": "Each weekday balances focused dual-skill practice, pairing one Math and one Reading & Writing skill, starting Monday with the weakest skills to build foundational strength, midweek targeting moderate skills to deepen mastery, and Friday dedicated to comprehensive review and error analysis. Saturday features a full-length timed SAT practice test followed by detailed answer review to identify patterns and reinforce learning. Sunday serves as a Flex Day to rest, reflect, and adapt the study plan based on weekly self-assessment."
        },
        {
            "title": "Flex Day Activities",
            "description": "Use this day for low-pressure reflection on errors made during the week, journaling insights and adjusting strategies. Experiment with a new study tool or technique for a limited trial to satisfy curiosity while committing to mastery in the coming week. Engage in mixed-skill challenge sets that blend Reading & Writing and Math to enhance cognitive flexibility. Incorporate mindfulness or light physical activity to recharge focus. Set clear, achievable goals for the next week to maintain momentum and structure."
        }
    ]
}