{
    "title": "Elevation Phase",
    "description": [
        {
            "title": "Weekly Goals",
            "description": "Aim to steadily improve accuracy in both Math and Reading & Writing by focusing on second-tier skills with measurable progress in problem-solving speed and reasoning under moderate time pressure. Reduce careless mistakes by implementing structured review cycles that analyze errors, adapt strategies, and retest to reinforce mastery. Strengthen cognitive flexibility by applying strategic practice methods that deepen understanding and sustain effort across prioritized skill areas."
        },
        {
            "title": "Skill Areas",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": "Rhetorical Synthesis, Inferences, Text Structure and Purpose"
                },
                {
                    "title": "Math",
                    "description": "Ratios, rates, proportional relationships, and units, Systems of two linear equations in two variables, Linear equations in one variable, Area and volume, Lines, angles, and triangles"
                }
            ]
        },
        {
            "title": "Practice Methods",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": {
                        "Rhetorical Synthesis": "Engage in timed practice sets that require synthesizing multiple viewpoints within complex passages, followed by reflective journaling to connect ideas and identify patterns in argument structure, reinforcing advanced comprehension through deliberate trial and error.",
                        "Inferences": "Work through challenging inference questions under timed conditions, then review each answer by mapping textual evidence to conclusions, fostering adaptive reasoning and deepening insight through iterative feedback cycles.",
                        "Text Structure and Purpose": "Master difficult question types by outlining passage structures during timed drills, then analyze how each section contributes to the author’s purpose, integrating speed work with reflective practice to optimize accuracy and strategic reading."
                    }
                },
                {
                    "title": "Math",
                    "description": {
                        "Ratios, rates, proportional relationships, and units": "Commit to solving multi-step word problems involving ratios and unit conversions under timed conditions, explicitly writing out units and conversion factors to build precision and avoid common errors, while reflecting weekly on problem-solving approaches to refine technique.",
                        "Systems of two linear equations in two variables": "Practice solving complex systems using substitution and elimination methods within strict time limits, followed by self-assessment of solution accuracy and speed, emphasizing clear step-by-step work to minimize careless mistakes and reinforce mastery.",
                        "Linear equations in one variable": "Focus on multi-step linear equations and inequalities by solving progressively harder problems under timed settings, ensuring to check solutions by substitution and tracking error patterns to adapt strategies effectively.",
                        "Area and volume": "Engage in timed exercises calculating areas and volumes of composite figures, incorporating unit conversions and formula application, then review errors to strengthen conceptual understanding and procedural fluency.",
                        "Lines, angles, and triangles": "Work on advanced geometry problems involving congruence, similarity, and angle relationships under moderate time pressure, drawing detailed diagrams and writing proofs to solidify reasoning and reduce oversight."
                    }
                }
            ]
        },
        {
            "title": "Weekly Structure",
            "description": "Each weekday balances focused dual-skill practice pairing one Math and one Reading & Writing skill, starting Monday with the weakest skills to build foundational strength, midweek targeting moderate skills to deepen mastery, and Friday dedicated to comprehensive review and error analysis. Saturday features one full-length timed SAT practice test followed by a thorough review session emphasizing understanding mistakes and adapting strategies. Sunday serves as a Flex Day to recharge and reflect, maintaining a flexible yet consistent routine that supports sustained effort and growth."
        },
        {
            "title": "Flex Day Activities",
            "description": "Use this day for low-pressure reflection on errors from the week, journaling insights and adjusting goals to maintain focus. Experiment with a new study tool or technique for one skill area, committing to a short trial to satisfy curiosity while building discipline. Engage in mixed-skill challenge sets that blend Math and Reading & Writing to enhance cognitive flexibility. Incorporate mindfulness or light physical activity to restore mental energy. Finally, set clear, achievable short-term goals for the upcoming week to anchor motivation and structure."
        }
    ]
}