{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context' questions, focus on annotating key context clues—such as definitions, contrasts, or examples—right away to build your confidence in trusting your initial interpretation. Practice paraphrasing challenging sentences aloud to deepen understanding without getting stuck on perfect definitions.",
        "Develop a habit of quickly outlining the form and structure of passages during practice to anticipate the author’s intent and logical flow. Use timed drills to practice identifying paragraph purposes and transitions, training yourself to make decisive structural judgments under pressure.",
        "In rhetorical synthesis exercises, challenge yourself to summarize and connect ideas from multiple sources within strict time limits. After each practice, journal moments when your synthesis was accurate to reinforce trusting your analytical instincts and reduce hesitation in integrating complex information.",
        "For nonlinear functions, consistently sketch graphs before solving problems to visualize behavior and reduce overanalysis. Set a timer for each problem to encourage quicker decision-making while maintaining accuracy, and review solutions to confirm when your first approach was correct.",
        "When working on systems of linear equations word problems, practice translating scenarios into equations with clear variable labels under timed conditions. After solving, reflect on your process to identify when trusting your initial setup led to correct answers, helping you build confidence in committing to solutions faster.",
        "In isolating equivalent expressions, break down each step methodically and write out your operations clearly to avoid confusion. Use timed practice to build fluency in rearranging formulas, and after each session, note instances where moving forward without perfect certainty still yielded correct results to strengthen your decisiveness."
    ]
}