{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context' questions, leverage your natural attention to detail by annotating key context clues—such as synonyms, antonyms, and contrast words—directly on the passage. To build confidence and reduce second-guessing, practice quick timed drills where you commit to your first interpretation and then review accuracy to reinforce trust in your instincts.",
        "For mastering 'Boundaries' in Writing and Language, focus on identifying independent clauses and practice rewriting sentences aloud to hear natural pauses. Use timed exercises to decide on punctuation quickly, pairing this with positive feedback from peers or mentors to help you overcome hesitation and build fluency in applying punctuation rules under pressure.",
        "Enhance your understanding of 'Form, Structure, and Sense' by outlining passages briefly during practice to track paragraph purposes and transitions. Challenge yourself to explain the author’s intent aloud within a set time limit, which will help you trust your analytical skills and reduce rumination on past mistakes while sharpening your ability to spot logical flow efficiently.",
        "When working with 'Nonlinear Functions,' capitalize on your puzzle-solving strength by sketching graphs before solving problems to visualize function behavior. Incorporate timed problem sets where you commit to solutions quickly, then review errors constructively to build confidence in your technical mastery and decision-making speed.",
        "For 'Linear Functions' word problems, practice translating scenarios into equations using diagrams or tables to organize information clearly. Use quick-recall drills to write and solve equations under timed conditions, celebrating streaks of correct answers to reinforce your accuracy and reduce hesitation in committing to solutions.",
        "In 'Linear Equations in Two Variables,' systematically label variables and write equations step-by-step to avoid errors. Pair this with timed practice sessions where you solve systems and immediately check your answers, using positive reinforcement to build trust in your problem-solving process and maintain momentum during the test."
    ]
}