{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context,' leverage your determination by actively annotating passages to identify context clues like synonyms, antonyms, and contrasts. Regularly paraphrase challenging sentences to deepen your understanding and prevent assumptions based on prior knowledge, ensuring your focus stays sharp and precise.",
        "Use your strong routine to outline passages briefly as you read, noting the form and structure. This will help you anticipate question types and maintain clarity on the author’s intent. Incorporate reflection after each practice to recognize how transitions and paragraph purposes contribute to coherence, reinforcing your progress without fixating solely on scores.",
        "Apply your disciplined work ethic to mastering sentence boundaries by practicing rewriting run-ons and comma splices with varied punctuation techniques. Schedule short, mindful breaks during these exercises to maintain mental resilience and avoid burnout, allowing you to internalize punctuation rules more effectively.",
        "For nonlinear functions, channel your ambition by sketching graphs before solving problems to visualize behavior clearly. Use your consistency to memorize key formulas and practice multiple solving methods, which will build confidence and flexibility when facing complex nonlinear questions.",
        "When working on systems involving linear and quadratic equations, use your focus to master substitution carefully, double-checking each step to avoid errors. Reflect on the discriminant’s meaning after solving to deepen your conceptual understanding, balancing your drive with thoughtful analysis rather than rushing through.",
        "In solving systems of linear equations, maintain your structured approach by choosing the most efficient method—substitution or elimination—based on the problem. Incorporate brief journaling after practice sessions to note what strategies worked and where you can adapt, fostering resilience and preventing the pressure of perfection from limiting your growth."
    ]
}