{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "Leverage your curiosity by actively annotating challenging words in diverse passages and use context clues systematically to infer meanings before checking definitions. Commit to mastering one vocabulary strategy each week to deepen your understanding rather than jumping between methods.",
        "Create a weekly outline habit where you briefly map the form and structure of passages you read, focusing on transitions and paragraph purposes. This structured reflection will help you build consistent expertise in recognizing logical flow and author intent, anchoring your flexible learning in steady progress.",
        "Pair your natural experimentation with disciplined practice by tackling paired command of evidence questions in timed sets. After each set, reflect on your evidence choices and refine your approach, using a habit tracker to ensure you commit to mastering this skill over several days rather than switching strategies prematurely.",
        "Use your adaptability to visualize nonlinear function graphs daily, sketching key features and annotating how coefficients affect shape. Commit to a ‘method of the week’ by focusing on one solving technique—like factoring or the quadratic formula—and practice it exclusively to build depth before moving on.",
        "Develop a consistent substitution practice routine for solving systems of linear and quadratic equations. Set short-term goals to solve a set number of problems daily, then self-assess accuracy and speed weekly, using your reflective strength to adjust your approach without losing focus on mastery.",
        "Anchor your flexible mindset by establishing a step-by-step checklist for solving systems of linear equations, including verifying solutions in both equations. Use this routine consistently to build reliability, and reward yourself for following through fully before experimenting with alternative methods."
    ]
}