[
    {
        "name": "Nonlinear functions",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:advanced-math-easier/x0fcc98a58ba3bea7:nonlinear-functions-easier/a/v2-sat-lesson-nonlinear-functions"
        ],
        "summary": "**Summary: Understanding Nonlinear Functions for SAT Math**\n\n---\n\n### Overview\n\nThis summary focuses on nonlinear functions, a key topic in advanced SAT math. Nonlinear functions differ from linear ones because their graphs are not straight lines; instead, they can be curves such as parabolas, circles, or other shapes. Mastering nonlinear functions is essential for solving a variety of SAT problems involving quadratic equations, inequalities, and function behavior.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Definition of Nonlinear Functions**  \n   - Unlike linear functions (which have the form *y = mx + b*), nonlinear functions include variables raised to powers other than one, variables multiplied together, or variables inside roots or absolute values.\n   - Common examples: quadratic functions (*y = ax² + bx + c*), cubic functions, and functions involving square roots or absolute values.\n\n2. **Graph Characteristics**  \n   - Nonlinear graphs are curves, not straight lines.\n   - Quadratic functions form parabolas that open upwards or downwards depending on the leading coefficient.\n   - Understanding the shape helps in interpreting function behavior and solving related problems.\n\n3. **Solving Nonlinear Equations**  \n   - Techniques include factoring, using the quadratic formula, completing the square, or graphing.\n   - Solutions correspond to the points where the function crosses the x-axis (roots or zeros).\n\n4. **Function Behavior and Transformations**  \n   - Recognizing how changes in the equation affect the graph (shifts, stretches, reflections).\n   - For example, adding a constant shifts the graph vertically; multiplying by a negative reflects it across the x-axis.\n\n5. **Inequalities Involving Nonlinear Functions**  \n   - Solving inequalities requires understanding where the function is above or below the x-axis.\n   - This often involves finding critical points (roots) and testing intervals.\n\n---\n\n### Study Tips\n\n- **Visualize the Graphs:** Always try to sketch or imagine the graph of the function to understand its behavior.\n- **Memorize Key Forms:** Know the standard forms of quadratic and other common nonlinear functions.\n- **Practice Factoring and Quadratic Formula:** These are essential tools for solving nonlinear equations.\n- **Work on Interval Testing:** For inequalities, practice determining where the function is positive or negative.\n- **Use Function Transformations:** Understand how changes in the equation affect the graph to quickly analyze problems.\n\n---\n\n### Recommended Exercises\n\n- **Graphing Practice:** Plot various nonlinear functions by hand to get comfortable with their shapes.\n- **Equation Solving:** Solve quadratic equations using factoring, completing the square, and the quadratic formula.\n- **Inequality Problems:** Solve and graph inequalities involving quadratic functions.\n- **Function Transformation Tasks:** Given a base function, apply shifts, stretches, and reflections and sketch the resulting graph.\n- **Word Problems:** Apply nonlinear functions to real-world contexts to strengthen conceptual understanding.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Assuming All Functions Are Linear:** Remember that nonlinear functions do not graph as straight lines.\n- **Ignoring the Leading Coefficient:** The sign and size of the leading coefficient affect the parabola’s direction and width.\n- **Forgetting to Test Intervals in Inequalities:** Simply finding roots is not enough; you must check intervals to determine where the inequality holds.\n- **Mixing Up Function Transformations:** Be careful with the direction of shifts and reflections; adding inside the function shifts horizontally, outside shifts vertically.\n- **Skipping Steps in Solving Equations:** Always check for extraneous solutions, especially when dealing with square roots or absolute values.\n\n---\n\nBy focusing on these concepts and practicing the recommended exercises, students can build a strong understanding of nonlinear functions and confidently tackle related SAT math problems."
    },
    {
        "name": "Linear equations in two variables",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:algebra-easier/x0fcc98a58ba3bea7:systems-of-linear-equations-word-problems-easier/a/v2-sat-lesson-systems-of-linear-equations-word-problems"
        ],
        "summary": "**Summary: Systems of Linear Equations Word Problems**\n\n---\n\n### Overview\n\nThis topic focuses on solving word problems that involve systems of linear equations. These problems require translating real-world situations into two or more linear equations and then finding the values of the variables that satisfy all equations simultaneously. Mastery of this skill is essential for standardized tests like the SAT and for understanding how to model and solve practical problems mathematically.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Understanding Systems of Linear Equations**  \n   A system consists of two or more linear equations with the same variables. The solution is the set of variable values that make all equations true at once.\n\n2. **Setting Up Equations from Word Problems**  \n   - Identify the variables: Assign letters to unknown quantities.  \n   - Translate the problem’s conditions into equations: Use relationships described in the problem to form equations.  \n   - Pay attention to units and quantities to ensure equations accurately represent the problem.\n\n3. **Methods to Solve Systems**  \n   - **Substitution:** Solve one equation for one variable, then substitute into the other equation.  \n   - **Elimination:** Add or subtract equations to eliminate one variable, making it easier to solve for the other.  \n   - **Graphing (conceptual):** Understand that the solution corresponds to the intersection point of the lines represented by the equations.\n\n4. **Interpreting the Solution**  \n   After solving, plug the values back into the original context to ensure they make sense (e.g., no negative quantities if the problem context forbids them).\n\n---\n\n### Actionable Study Tips\n\n- **Practice translating words into equations:** Focus on carefully reading the problem and identifying what each sentence implies mathematically.  \n- **Label variables clearly:** Write down what each variable represents to avoid confusion.  \n- **Check your work:** After solving, substitute your answers back into the original equations and the word problem to verify correctness.  \n- **Work step-by-step:** Don’t rush; carefully isolate variables and perform algebraic operations methodically.  \n- **Use estimation:** Before solving, estimate what the answer might be to catch unreasonable solutions.\n\n---\n\n### Recommended Exercises\n\n- **Basic translation problems:** Practice converting simple word problems into two linear equations.  \n- **Substitution and elimination practice:** Solve systems using both methods to build flexibility.  \n- **Real-life context problems:** Work on problems involving mixtures, rates, costs, and ages to see varied applications.  \n- **Check solutions:** After solving, write a sentence explaining what the solution means in the problem’s context.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Misidentifying variables:** Assigning variables incorrectly or inconsistently can lead to wrong equations.  \n- **Ignoring units or problem constraints:** For example, negative answers may not make sense in some contexts.  \n- **Errors in algebraic manipulation:** Mistakes in substitution or elimination steps can derail the solution.  \n- **Not verifying solutions:** Failing to check answers in the original problem can result in accepting incorrect solutions.  \n- **Rushing through problem setup:** Skipping careful reading often leads to incorrect equations.\n\n---\n\nBy focusing on these strategies and practicing a variety of word problems, students can develop strong skills in solving systems of linear equations and confidently apply them in exam settings."
    },
    {
        "name": "Nonlinear equations in one variable and systems of equations in two variables",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:advanced-math-easier/x0fcc98a58ba3bea7:linear-and-quadratic-systems-easier/a/v2-sat-lesson-linear-and-quadratic-systems"
        ],
        "summary": "**Summary: Solving Systems of Linear and Quadratic Equations**\n\n---\n\n### Overview\n\nThis topic focuses on solving systems that include one linear equation and one quadratic equation simultaneously. Such systems are common in algebra and appear frequently in standardized tests like the SAT. Understanding how to find the points where a line and a parabola intersect is essential for mastering these problems.\n\n---\n\n### Key Concepts and Techniques\n\n1. **System Components:**\n   - A **linear equation** represents a straight line (e.g., \\( y = mx + b \\)).\n   - A **quadratic equation** represents a parabola (e.g., \\( y = ax^2 + bx + c \\)).\n\n2. **Goal:**\n   - Find all points \\((x, y)\\) that satisfy both equations simultaneously — these are the intersection points of the line and the parabola.\n\n3. **Method: Substitution**\n   - Since the linear equation is often solved for \\( y \\), substitute this expression into the quadratic equation.\n   - This substitution transforms the system into a single quadratic equation in terms of \\( x \\).\n\n4. **Solving the Quadratic:**\n   - After substitution, simplify and rearrange the quadratic equation.\n   - Use factoring, completing the square, or the quadratic formula to find the values of \\( x \\).\n\n5. **Finding Corresponding \\( y \\) Values:**\n   - Plug each \\( x \\) solution back into the linear equation to find the corresponding \\( y \\) values.\n\n6. **Number of Solutions:**\n   - The quadratic equation can have:\n     - Two distinct real solutions (two intersection points),\n     - One real solution (the line is tangent to the parabola),\n     - No real solutions (the line does not intersect the parabola).\n\n7. **Interpreting Solutions:**\n   - Each solution pair \\((x, y)\\) represents a point where the line and parabola meet on the coordinate plane.\n\n---\n\n### Study Tips\n\n- **Master substitution:** Practice isolating variables and substituting expressions carefully to avoid algebraic errors.\n- **Review quadratic solving methods:** Be comfortable with factoring, completing the square, and the quadratic formula.\n- **Check solutions:** Always substitute your answers back into both original equations to verify correctness.\n- **Understand the graph:** Visualize the line and parabola to anticipate the number of solutions.\n- **Practice with different forms:** Work on problems where the linear equation is given in various forms (e.g., standard form, slope-intercept form).\n\n---\n\n### Recommended Exercises\n\n- Solve systems where the linear equation is given explicitly for \\( y \\) and the quadratic is in standard form.\n- Practice substitution with more complex coefficients to build algebraic fluency.\n- Work on problems that require interpreting the number of solutions based on the discriminant of the quadratic.\n- Graph systems to connect algebraic solutions with their geometric meaning.\n- Attempt word problems involving real-world scenarios modeled by linear and quadratic systems.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Forgetting to substitute correctly:** Ensure the entire expression for \\( y \\) is substituted into the quadratic equation.\n- **Algebraic slips:** Be careful with signs and combining like terms after substitution.\n- **Ignoring extraneous solutions:** Sometimes, solutions may not satisfy both equations; always verify.\n- **Misinterpreting the discriminant:** Remember that a negative discriminant means no real intersection points.\n- **Not checking answers:** Always plug solutions back into both equations to confirm validity.\n\n---\n\nBy mastering these concepts and practicing systematically, students can confidently solve systems involving linear and quadratic equations, a skill valuable for exams and further math studies."
    },
    {
        "name": "Systems of two linear equations in two variables",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:algebra-easier/x0fcc98a58ba3bea7:solving-systems-of-linear-equations-easier/a/v2-sat-lesson-solving-systems-of-linear-equations"
        ],
        "summary": "**Summary: Solving Systems of Linear Equations**\n\n---\n\n### Overview\n\nThis topic focuses on understanding and solving systems of linear equations, which are sets of two or more linear equations involving the same variables. The goal is to find values for the variables that satisfy all equations simultaneously. This is a fundamental skill in algebra, often tested in exams like the SAT, and is essential for solving real-world problems involving multiple constraints.\n\n---\n\n### Key Concepts and Techniques\n\n1. **What is a System of Linear Equations?**  \n   A system consists of two or more linear equations with the same variables. For example:  \n   \\[\n   \\begin{cases}\n   2x + 3y = 6 \\\\\n   x - y = 4\n   \\end{cases}\n   \\]  \n   The solution is the point(s) where the equations intersect on a graph.\n\n2. **Methods to Solve Systems:**\n\n   - **Graphing:**  \n     Plot each equation on a coordinate plane and identify the intersection point. This method provides a visual understanding but may lack precision for exact answers.\n\n   - **Substitution:**  \n     Solve one equation for one variable, then substitute that expression into the other equation. This reduces the system to a single equation with one variable.\n\n   - **Elimination (Addition/Subtraction):**  \n     Add or subtract equations to eliminate one variable, making it easier to solve for the remaining variable.\n\n3. **Types of Solutions:**\n\n   - **One solution:** The lines intersect at a single point (consistent and independent system).\n   - **No solution:** The lines are parallel and never intersect (inconsistent system).\n   - **Infinite solutions:** The lines coincide (dependent system).\n\n4. **Checking Solutions:**  \n   Always substitute your solution back into the original equations to verify correctness.\n\n---\n\n### Study Tips\n\n- **Understand each method:** Practice solving systems using graphing, substitution, and elimination to know when each is most efficient.\n- **Work step-by-step:** Carefully isolate variables and perform arithmetic operations to avoid mistakes.\n- **Visualize problems:** Sketch graphs when possible to get an intuitive grasp of the solution.\n- **Practice word problems:** Translate real-life situations into systems of equations to improve problem-solving skills.\n- **Double-check answers:** Always plug solutions back into the original equations.\n\n---\n\n### Recommended Exercises\n\n- Solve systems with two variables using substitution and elimination.\n- Graph pairs of linear equations and identify the intersection points.\n- Classify systems based on the number of solutions (one, none, or infinite).\n- Translate word problems into systems and solve.\n- Practice systems with coefficients that require multiplying equations before elimination.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Arithmetic errors:** Miscalculations during substitution or elimination can lead to wrong answers.\n- **Forgetting to apply operations to entire equations:** When multiplying or adding equations, apply the operation to every term.\n- **Misidentifying the type of system:** Confusing parallel lines (no solution) with coincident lines (infinite solutions).\n- **Not checking solutions:** Skipping verification can result in accepting incorrect answers.\n- **Ignoring variable isolation order:** In substitution, solve for the variable that is easiest to isolate to simplify calculations.\n\n---\n\nBy mastering these concepts and practicing systematically, students can confidently solve systems of linear equations and apply these skills effectively in exams and real-world scenarios."
    },
    {
        "name": "Right triangles and trigonometry",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:geometry-and-trigonometry-easier/x0fcc98a58ba3bea7:right-triangle-trigonometry-easier/a/v2-sat-lesson-right-triangle-trigonometry"
        ],
        "summary": "**Summary: Right Triangle Trigonometry for Exam Preparation**\n\n---\n\n### Overview\n\nRight triangle trigonometry is a fundamental topic in geometry and trigonometry that deals with the relationships between the angles and sides of right-angled triangles. This concept is essential for solving problems involving distances, heights, and angles in various math exams, including the SAT. Understanding how to use trigonometric ratios—sine, cosine, and tangent—allows students to find unknown side lengths or angles when given partial information about a right triangle.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Right Triangle Basics**  \n   - A right triangle has one 90-degree angle.  \n   - The side opposite the right angle is the hypotenuse, the longest side.  \n   - The other two sides are called legs.\n\n2. **Trigonometric Ratios**  \n   These ratios relate an acute angle in a right triangle to the lengths of the sides:  \n   - **Sine (sin)** = Opposite side / Hypotenuse  \n   - **Cosine (cos)** = Adjacent side / Hypotenuse  \n   - **Tangent (tan)** = Opposite side / Adjacent side\n\n3. **Using Trigonometric Ratios to Find Unknowns**  \n   - If you know one acute angle and one side, you can find other sides using the appropriate ratio.  \n   - If you know two sides, you can find an angle by taking the inverse sine, cosine, or tangent (e.g., sin⁻¹, cos⁻¹, tan⁻¹).\n\n4. **Labeling the Triangle Correctly**  \n   - Identify the angle of interest (other than the right angle).  \n   - Determine which side is opposite, adjacent, and the hypotenuse relative to that angle.\n\n5. **Solving Word Problems**  \n   - Translate real-world scenarios into right triangle problems.  \n   - Draw a diagram to visualize the problem.  \n   - Assign variables to unknown sides or angles.  \n   - Apply trigonometric ratios to solve for unknowns.\n\n---\n\n### Study Tips\n\n- **Memorize the definitions of sine, cosine, and tangent** and understand how they relate to the triangle’s sides.  \n- **Practice labeling triangles** from different perspectives to become comfortable identifying opposite, adjacent, and hypotenuse sides.  \n- **Use inverse trigonometric functions** on your calculator to find angles when sides are known.  \n- **Draw diagrams for word problems** to better visualize the situation and avoid confusion.  \n- **Check your answers** by verifying that side lengths make sense (e.g., hypotenuse should be the longest side).\n\n---\n\n### Recommended Exercises\n\n- **Basic ratio problems:** Given one angle and one side, find the missing side.  \n- **Angle finding problems:** Given two sides, calculate the unknown angle using inverse trig functions.  \n- **Mixed problems:** Combine knowledge of Pythagorean theorem and trigonometry to solve for missing sides or angles.  \n- **Word problems:** Apply trigonometry to real-life contexts such as finding heights of objects or distances across gaps.  \n- **Practice with different angles:** Work on problems involving various acute angles to build flexibility.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Confusing opposite and adjacent sides:** Always label sides relative to the angle you are using.  \n- **Using the wrong trigonometric ratio:** Choose sine, cosine, or tangent based on which sides you know and which you need to find.  \n- **Forgetting the hypotenuse is always the longest side:** This helps in checking if your answers are reasonable.  \n- **Not using inverse functions correctly:** Remember that inverse trig functions are used to find angles, not sides.  \n- **Ignoring the calculator mode:** Ensure your calculator is set to degrees (or radians, if specified) consistent with the problem.\n\n---\n\nBy mastering these concepts and practicing a variety of problems, students will be well-prepared to tackle right triangle trigonometry questions confidently on their exams."
    },
    {
        "name": "Area and volume",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:geometry-and-trigonometry-easier/x0fcc98a58ba3bea7:area-and-volume-easier/a/v2-sat-lesson-area-and-volume"
        ],
        "summary": "**Summary: Understanding Area and Volume for Exam Preparation**\n\n---\n\n### Overview\n\nThis summary covers the fundamental concepts of calculating area and volume, essential topics in geometry often tested in standardized exams like the SAT. Mastery of these concepts helps in solving problems involving two-dimensional shapes and three-dimensional solids efficiently.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Area of 2D Shapes**  \n   - **Rectangles and Squares:** Area = length × width  \n   - **Triangles:** Area = ½ × base × height  \n   - **Parallelograms:** Area = base × height  \n   - **Trapezoids:** Area = ½ × (sum of parallel sides) × height  \n   - **Circles:** Area = π × radius²  \n\n2. **Volume of 3D Solids**  \n   - **Rectangular Prisms (Boxes):** Volume = length × width × height  \n   - **Cylinders:** Volume = π × radius² × height  \n   - **Pyramids:** Volume = ⅓ × base area × height  \n   - **Cones:** Volume = ⅓ × π × radius² × height  \n   - **Spheres:** Volume = ⁴⁄₃ × π × radius³  \n\n3. **Surface Area** (briefly related)  \n   - Calculated by summing the areas of all faces or surfaces of a solid.\n\n4. **Units and Conversions**  \n   - Area units are squared (e.g., cm², m²)  \n   - Volume units are cubed (e.g., cm³, m³)  \n   - Always ensure consistent units before calculating.\n\n5. **Using Formulas Effectively**  \n   - Identify the shape correctly  \n   - Label all given dimensions clearly  \n   - Substitute values carefully into formulas  \n   - Simplify step-by-step to avoid errors\n\n---\n\n### Study Tips\n\n- **Memorize Key Formulas:** Focus on the area and volume formulas for common shapes and solids. Flashcards can help reinforce these.  \n- **Draw Diagrams:** Visualizing the problem by sketching shapes helps understand which formula to apply.  \n- **Practice Unit Conversion:** Be comfortable converting between units (e.g., cm to m) to avoid mistakes.  \n- **Break Complex Figures into Simpler Parts:** For irregular shapes or composite solids, divide them into basic shapes, calculate areas or volumes separately, then combine results.  \n- **Check Reasonableness:** After solving, estimate if the answer makes sense (e.g., volume should be larger than area).\n\n---\n\n### Recommended Exercises\n\n- **Calculate area for various 2D shapes:** Practice with rectangles, triangles, trapezoids, and circles using different dimensions.  \n- **Find volume of solids:** Work on rectangular prisms, cylinders, cones, pyramids, and spheres.  \n- **Composite figures:** Solve problems involving shapes made by combining or subtracting basic shapes.  \n- **Word problems:** Apply area and volume formulas in real-life contexts, such as finding paint needed for walls or water in a tank.  \n- **Unit conversion problems:** Exercises that require converting units before calculating area or volume.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Mixing up formulas:** Confusing area formulas with volume formulas or using the wrong formula for a shape.  \n- **Ignoring units:** Forgetting to convert units or mixing different units in one calculation.  \n- **Incorrect height or base identification:** Using the wrong dimension as height or base, especially in triangles and parallelograms.  \n- **Forgetting to multiply by ½ or ⅓:** Missing these fractions in triangle, pyramid, or cone formulas leads to wrong answers.  \n- **Rounding too early:** Keep calculations exact until the final step to avoid compounding rounding errors.\n\n---\n\nBy understanding these core principles and practicing regularly, students can confidently tackle area and volume problems on exams."
    },
    {
        "name": "Linear equations in one variable",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:algebra-easier/x0fcc98a58ba3bea7:solving-linear-equations-and-inequalities-easier/a/v2-sat-lesson-solving-linear-equations-and-inequalities"
        ],
        "summary": "**Summary: Solving Linear Equations and Inequalities**\n\n---\n\n### Overview\n\nThis topic focuses on understanding and solving linear equations and inequalities, which are foundational skills in algebra and essential for standardized tests like the SAT. Linear equations involve expressions set equal to each other, typically with variables raised to the first power. Inequalities are similar but use inequality signs (>, <, ≥, ≤) instead of an equal sign. Mastery of these concepts enables students to solve for unknown variables and understand relationships between quantities.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Linear Equations Basics**  \n   - A linear equation is an equation where the variable(s) appear only to the first power (e.g., 2x + 3 = 7).  \n   - The goal is to isolate the variable on one side to find its value.\n\n2. **Solving Linear Equations**  \n   - Use inverse operations (addition/subtraction, multiplication/division) to simplify and isolate the variable.  \n   - Maintain balance by performing the same operation on both sides of the equation.  \n   - Combine like terms and simplify expressions before isolating the variable.  \n   - Check solutions by substituting the value back into the original equation.\n\n3. **Solving Linear Inequalities**  \n   - Similar to equations, but solutions are ranges of values rather than single numbers.  \n   - When multiplying or dividing both sides by a negative number, reverse the inequality sign.  \n   - Express solutions using inequality notation or graphically on a number line.\n\n4. **Multi-step Problems**  \n   - Some equations or inequalities require multiple steps, including distributing multiplication over addition/subtraction, combining like terms, and moving terms across the inequality or equal sign.\n\n5. **Special Cases**  \n   - Equations that simplify to a true statement (e.g., 0=0) have infinitely many solutions.  \n   - Equations that simplify to a false statement (e.g., 0=5) have no solution.\n\n---\n\n### Study Tips\n\n- **Practice isolating variables step-by-step**: Write down each operation clearly and perform the same operation on both sides to keep the equation balanced.  \n- **Memorize the rule about reversing inequality signs** when multiplying or dividing by negative numbers, as this is a common source of errors.  \n- **Work through examples with different structures**: single-step, multi-step, with variables on both sides, and involving parentheses.  \n- **Check your answers** by plugging solutions back into the original equation or inequality to verify correctness.  \n- **Use number lines** to visualize inequality solutions and understand the range of possible values.\n\n---\n\n### Recommended Exercises\n\n- **Single-step equations and inequalities**: Solve for x in simple expressions like x + 5 = 12 or 3x > 9.  \n- **Multi-step equations**: Include problems with distribution and combining like terms, e.g., 2(x + 3) = 14.  \n- **Inequalities involving negative coefficients**: Practice reversing inequality signs correctly, e.g., -2x ≤ 6.  \n- **Word problems**: Translate real-world situations into linear equations or inequalities and solve them.  \n- **Graphing solutions**: Plot inequality solutions on number lines to reinforce understanding of solution sets.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Failing to perform the same operation on both sides** of the equation or inequality, which breaks the balance and leads to incorrect answers.  \n- **Forgetting to reverse the inequality sign** when multiplying or dividing by a negative number.  \n- **Neglecting to simplify expressions fully** before isolating the variable, which can complicate the solving process.  \n- **Misinterpreting the solution to inequalities** as a single number rather than a range or interval.  \n- **Not checking solutions** by substituting back into the original equation or inequality, missing errors made during solving.\n\n---\n\nBy mastering these concepts and practicing a variety of problems, students will build confidence in solving linear equations and inequalities, a critical skill for algebra and standardized test success."
    },
    {
        "name": "Linear functions",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:algebra-easier/x0fcc98a58ba3bea7:linear-relationship-word-problems-easier/a/v2-sat-lesson-understanding-linear-relationships"
        ],
        "summary": "**Summary: Understanding Linear Relationships in Word Problems**\n\n---\n\n### Overview\n\nThis lesson focuses on interpreting and solving word problems that involve linear relationships. Linear relationships describe situations where one quantity changes at a constant rate relative to another, which can be represented by linear equations. Mastering these problems is essential for exams like the SAT, where you need to translate real-world scenarios into mathematical expressions and solve for unknowns.\n\n---\n\n### Key Concepts and Techniques\n\n- **Linear Relationship Definition:**  \n  A linear relationship between two variables means that as one variable changes, the other changes at a constant rate. This can be expressed as an equation of the form:  \n  \\[\n  y = mx + b\n  \\]  \n  where \\(m\\) is the rate of change (slope) and \\(b\\) is the starting value (y-intercept).\n\n- **Identifying Variables:**  \n  In word problems, the first step is to determine what quantities correspond to \\(x\\) and \\(y\\). Usually, \\(x\\) represents the independent variable (input), and \\(y\\) represents the dependent variable (output).\n\n- **Interpreting the Rate of Change:**  \n  The rate of change is how much \\(y\\) changes for each unit increase in \\(x\\). For example, if a problem states that a car travels 60 miles every hour, the rate of change is 60 miles/hour.\n\n- **Finding the Starting Value:**  \n  The starting value is the amount when the independent variable is zero. For example, if a phone plan charges a fixed monthly fee plus a cost per minute, the fixed fee is the starting value.\n\n- **Writing the Equation:**  \n  Translate the problem’s information into the linear equation \\(y = mx + b\\), plugging in the rate of change for \\(m\\) and the starting value for \\(b\\).\n\n- **Solving for Unknowns:**  \n  Use the equation to find missing values by substituting known quantities and solving for the unknown variable.\n\n- **Checking Solutions:**  \n  Always verify your answer makes sense in the context of the problem.\n\n---\n\n### Actionable Study Tips\n\n- **Practice Translating Words to Math:**  \n  Focus on converting sentences into mathematical expressions. Identify keywords like \"per,\" \"each,\" \"starts at,\" or \"increases by\" to find the slope and intercept.\n\n- **Draw Tables or Graphs:**  \n  Organize information in tables or plot points on a graph to visualize the relationship.\n\n- **Work Backwards:**  \n  If given a result, try plugging it into your equation to find the input value.\n\n- **Use Units Consistently:**  \n  Keep track of units (hours, miles, dollars) to avoid confusion.\n\n- **Review Basic Algebra Skills:**  \n  Be comfortable with solving linear equations and manipulating expressions.\n\n---\n\n### Types of Exercises to Practice\n\n- **Word Problems with Rates and Starting Values:**  \n  Problems involving costs, distances, time, or quantities that change steadily.\n\n- **Equation Writing:**  \n  Given a scenario, write the corresponding linear equation.\n\n- **Solving for Variables:**  \n  Find unknown inputs or outputs using the linear equation.\n\n- **Interpreting Graphs:**  \n  Match graphs to word problems and vice versa.\n\n- **Checking Reasonableness:**  \n  Evaluate if answers fit the context logically.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Mixing Up Variables:**  \n  Confusing which quantity is independent or dependent can lead to incorrect equations.\n\n- **Ignoring the Starting Value:**  \n  Forgetting to include the initial amount \\(b\\) results in incomplete models.\n\n- **Misinterpreting the Rate of Change:**  \n  Not recognizing that the rate is per unit change can cause errors.\n\n- **Skipping Units:**  \n  Overlooking units can make answers meaningless or incorrect.\n\n- **Not Verifying Answers:**  \n  Failing to check if the solution fits the problem context can lead to mistakes.\n\n---\n\nBy understanding how to identify variables, interpret rates, write equations, and solve for unknowns, students can confidently tackle linear relationship word problems on exams. Regular practice with diverse problems and careful attention to details like units and starting values will strengthen problem-solving skills."
    },
    {
        "name": "Equivalent expressions",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:advanced-math-easier/x0fcc98a58ba3bea7:isolating-quantities-easier/a/v2-sat-lesson-isolating-quantities"
        ],
        "summary": "**Summary: Isolating Quantities in Algebra (SAT Math Preparation)**\n\n---\n\n### Overview\n\nIsolating quantities is a fundamental algebra skill essential for solving equations where you need to express one variable explicitly in terms of others. This technique is especially useful in standardized tests like the SAT, where problems often require rearranging formulas or equations to find the value of a specific variable. Mastering this skill helps in understanding relationships between variables and simplifies problem-solving in various math contexts.\n\n---\n\n### Key Concepts and Techniques\n\n- **Definition of Isolating a Quantity:**  \n  To isolate a quantity means to rewrite an equation so that the variable of interest stands alone on one side of the equation, typically the left side.\n\n- **Step-by-Step Process:**  \n  1. Identify the variable you need to isolate.  \n  2. Use inverse operations (addition ↔ subtraction, multiplication ↔ division) to move other terms away from the variable.  \n  3. Perform the same operation on both sides of the equation to maintain equality.  \n  4. Simplify the equation until the variable is alone.\n\n- **Common Operations Used:**  \n  - Addition and subtraction to move constants or terms.  \n  - Multiplication and division to remove coefficients or factors.  \n  - Factoring or distributing when variables appear in more complex expressions.  \n  - Handling fractions by multiplying both sides by the denominator.\n\n- **Working with Formulas:**  \n  Many problems involve formulas where you need to solve for a particular variable (e.g., solving for *x* in terms of *y* and *z*). This requires rearranging the formula carefully, applying the same principles.\n\n- **Avoiding Mistakes:**  \n  - Always perform the same operation on both sides.  \n  - Be cautious with negative signs and fractions.  \n  - Simplify step-by-step rather than trying to do multiple steps at once.  \n  - Check your final expression by substituting values if possible.\n\n---\n\n### Actionable Study Tips\n\n- **Practice Stepwise Rearrangement:**  \n  Work through equations slowly, ensuring each step logically follows from the previous one.\n\n- **Memorize Inverse Operations:**  \n  Be confident in reversing addition, subtraction, multiplication, and division.\n\n- **Use Sample Formulas:**  \n  Take common formulas (e.g., area, volume, physics formulas) and practice isolating different variables.\n\n- **Write Neatly and Organize Work:**  \n  Clear notation helps avoid confusion, especially with fractions and negative signs.\n\n- **Check Your Work:**  \n  After isolating the variable, plug in numbers to verify correctness.\n\n---\n\n### Recommended Exercises\n\n- **Simple Linear Equations:**  \n  Practice isolating variables in equations like *ax + b = c*.\n\n- **Multi-Step Equations:**  \n  Work on equations involving multiple operations, such as *a(x + b) = c*.\n\n- **Formulas Rearrangement:**  \n  Given formulas (e.g., *A = lw*, *C = 2πr*), solve for different variables.\n\n- **Fractional Equations:**  \n  Practice clearing denominators by multiplying both sides.\n\n- **Word Problems:**  \n  Translate word problems into equations and isolate the required variable.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Not Applying Operations to Both Sides:**  \n  Changing one side only breaks the equality.\n\n- **Ignoring Negative Signs:**  \n  Losing track of negatives can lead to incorrect answers.\n\n- **Skipping Steps:**  \n  Trying to do too much at once increases errors.\n\n- **Mismanaging Fractions:**  \n  Forgetting to multiply both sides by denominators or mishandling complex fractions.\n\n- **Forgetting to Simplify:**  \n  Leaving expressions unnecessarily complicated can cause confusion.\n\n---\n\nBy mastering the skill of isolating quantities, students can confidently tackle a wide range of algebra problems, especially those involving formulas and multi-step equations, which are common in exams like the SAT. Regular practice with careful attention to detail will build accuracy and speed."
    },
    {
        "name": "Lines, angles, and triangles",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:geometry-and-trigonometry-easier/x0fcc98a58ba3bea7:congruence-similarity-and-angle-relationships-easier/a/v2-sat-lesson-congruence-similarity-and-angle-relationships"
        ],
        "summary": "**Summary: Congruence, Similarity, and Angle Relationships in Geometry**\n\n---\n\n### Overview\n\nThis topic focuses on understanding the properties and relationships of geometric figures, particularly triangles and other polygons, through the concepts of congruence, similarity, and angle relationships. Mastery of these ideas is essential for solving a variety of geometry problems, especially those involving proofs, calculations of side lengths, and angle measures. These concepts are frequently tested in standardized exams like the SAT.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Congruence**\n   - Two figures are congruent if they have the exact same shape and size.\n   - Congruent triangles have corresponding sides and angles that are equal.\n   - Common criteria to prove triangle congruence:\n     - **SSS (Side-Side-Side):** All three pairs of corresponding sides are equal.\n     - **SAS (Side-Angle-Side):** Two sides and the included angle are equal.\n     - **ASA (Angle-Side-Angle):** Two angles and the included side are equal.\n     - **AAS (Angle-Angle-Side):** Two angles and a non-included side are equal.\n     - **HL (Hypotenuse-Leg) for right triangles:** Hypotenuse and one leg are equal.\n\n2. **Similarity**\n   - Two figures are similar if they have the same shape but not necessarily the same size.\n   - Corresponding angles are equal, and corresponding sides are proportional.\n   - Criteria for triangle similarity:\n     - **AA (Angle-Angle):** Two pairs of corresponding angles are equal.\n     - **SSS (Side-Side-Side) similarity:** Corresponding sides are in proportion.\n     - **SAS (Side-Angle-Side) similarity:** Two sides are proportional and the included angle is equal.\n\n3. **Angle Relationships**\n   - Understanding how angles relate within and between figures is crucial.\n   - Key angle pairs include:\n     - **Vertical angles:** Opposite angles formed by two intersecting lines; always equal.\n     - **Adjacent angles:** Share a common side and vertex.\n     - **Complementary angles:** Sum to 90 degrees.\n     - **Supplementary angles:** Sum to 180 degrees.\n     - **Angles on a straight line:** Sum to 180 degrees.\n     - **Angles in a triangle:** Sum to 180 degrees.\n     - **Exterior angle theorem:** An exterior angle of a triangle equals the sum of the two opposite interior angles.\n\n4. **Using Congruence and Similarity to Solve Problems**\n   - Identify corresponding parts of triangles or polygons.\n   - Use congruence to find exact side lengths or angle measures.\n   - Use similarity to find unknown lengths through proportional reasoning.\n   - Apply angle relationships to find missing angles.\n\n---\n\n### Study Tips\n\n- **Visualize and Draw Diagrams:** Always sketch the figure carefully, label all known sides and angles, and mark congruent or equal parts.\n- **Memorize Criteria:** Know the congruence and similarity rules by heart; they are the foundation for many problems.\n- **Practice Identifying Corresponding Parts:** When comparing two figures, clearly identify which sides and angles correspond.\n- **Use Algebra with Proportions:** For similarity problems, set up ratios of corresponding sides and solve for unknowns.\n- **Check Angle Sums:** Use the triangle angle sum and straight line angle properties to find missing angles.\n- **Work Backwards:** Sometimes starting from what you need to find and working back to known information helps.\n\n---\n\n### Recommended Exercises\n\n- **Proving Triangle Congruence:** Given two triangles, use SSS, SAS, ASA, AAS, or HL to prove they are congruent.\n- **Solving for Unknown Sides Using Similarity:** Set up and solve proportions based on similar triangles.\n- **Finding Missing Angles:** Use angle relationships in intersecting lines, triangles, and polygons.\n- **Applying the Exterior Angle Theorem:** Calculate unknown angles using the exterior angle property.\n- **Mixed Problems:** Combine congruence, similarity, and angle relationships to solve multi-step geometry problems.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Confusing Congruence with Similarity:** Remember congruent figures are identical in size and shape; similar figures only share shape.\n- **Incorrect Correspondence:** Mislabeling corresponding sides or angles leads to wrong conclusions.\n- **Ignoring Angle Sum Rules:** Forgetting that angles in a triangle sum to 180 degrees or that angles on a straight line sum to 180 degrees.\n- **Misapplying Criteria:** Using the wrong congruence or similarity rule for the given information.\n- **Overlooking the Included Angle:** For SAS and ASA, the angle must be between the two sides considered.\n- **Assuming Proportions Without Proof:** Do not assume triangles are similar without verifying the criteria.\n\n---\n\nBy understanding these core ideas and practicing a variety of problems, students will develop strong skills in geometric reasoning, which are vital for success in exams and further math studies."
    },
    {
        "name": "Ratios, rates, proportional relationships, and units",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:problem-solving-and-data-analysis-easier/x0fcc98a58ba3bea7:ratios-rates-and-proportions-easier/a/v2-sat-lesson-ratios-rates-and-proportions",
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:problem-solving-and-data-analysis-easier/x0fcc98a58ba3bea7:unit-conversion-easier/a/v2-sat-lesson-unit-conversion"
        ],
        "summary": "**Summary: Ratios, Rates, Proportions, and Unit Conversions for Exam Preparation**\n\n---\n\n### Overview\n\nThis summary covers essential math concepts frequently tested on standardized exams like the SAT, focusing on ratios, rates, proportions, and unit conversions. These topics are foundational for solving real-world problems involving comparisons, scaling, and measurement changes. Mastery of these concepts enables students to analyze relationships between quantities, convert units accurately, and apply proportional reasoning effectively.\n\n---\n\n### Key Concepts and Techniques\n\n#### 1. Ratios\n- **Definition:** A ratio compares two quantities, showing how many times one value contains or is contained within the other.\n- **Representation:** Ratios can be written as fractions (a/b), with a colon (a:b), or in words (\"a to b\").\n- **Use:** Ratios express relationships such as mixing ingredients, comparing speeds, or scaling figures.\n\n#### 2. Rates\n- **Definition:** A rate is a specific type of ratio comparing two quantities with different units (e.g., miles per hour, dollars per pound).\n- **Interpretation:** Rates describe how one quantity changes relative to another, often involving time or distance.\n- **Application:** Understanding rates helps solve problems involving speed, density, price per unit, and more.\n\n#### 3. Proportions\n- **Definition:** A proportion states that two ratios or rates are equal.\n- **Solving Proportions:** Use cross-multiplication to find unknown values in proportional relationships.\n- **Use Cases:** Proportions are useful for scaling recipes, maps, models, or converting currencies.\n\n#### 4. Unit Conversions\n- **Purpose:** Unit conversion changes a measurement from one unit to another within the same system or between systems (e.g., inches to centimeters, hours to minutes).\n- **Conversion Factors:** Use known equivalences (e.g., 1 inch = 2.54 cm) as multiplication or division factors.\n- **Process:** Multiply or divide the original quantity by the conversion factor, ensuring units cancel appropriately.\n- **Compound Conversions:** Sometimes multiple steps are needed (e.g., converting miles per hour to feet per second).\n\n---\n\n### Actionable Study Tips\n\n- **Understand the Relationships:** Focus on grasping how quantities relate rather than memorizing formulas.\n- **Practice Setting Up Ratios and Proportions:** Write out ratios clearly and check units carefully.\n- **Master Cross-Multiplication:** This is a reliable method to solve proportions quickly and accurately.\n- **Memorize Common Conversion Factors:** Keep a list of standard conversions handy for quick reference.\n- **Work Through Word Problems:** Translate verbal descriptions into mathematical ratios or rates.\n- **Check Units at Every Step:** Always verify that units cancel correctly to avoid errors.\n- **Use Estimation:** Before calculating, estimate the answer to catch unreasonable results.\n\n---\n\n### Recommended Exercises\n\n- **Ratio Identification:** Given two quantities, write their ratio in different forms.\n- **Rate Problems:** Calculate rates from given data (e.g., speed, price per item).\n- **Proportion Solving:** Solve for unknowns in proportion equations using cross-multiplication.\n- **Unit Conversion Drills:** Convert measurements within and between systems, including multi-step conversions.\n- **Word Problems:** Apply ratios, rates, and conversions to real-life scenarios such as recipes, travel, and shopping.\n- **Mixed Practice:** Combine ratios, proportions, and unit conversions in single problems to build integrated understanding.\n\n---\n\n### Common Mistakes and Pitfalls to Avoid\n\n- **Ignoring Units:** Failing to track or convert units properly leads to incorrect answers.\n- **Misinterpreting Ratios:** Confusing the order of terms in a ratio can change the meaning.\n- **Incorrect Cross-Multiplication:** Forgetting to multiply diagonally or mixing up terms.\n- **Skipping Steps in Conversion:** Trying to convert units in one step without proper factors causes errors.\n- **Overlooking Simplification:** Not reducing ratios or fractions can complicate calculations.\n- **Rushing Through Word Problems:** Missing key information or misreading quantities leads to setup errors.\n\n---\n\nBy focusing on these core ideas and practicing systematically, students can confidently tackle problems involving ratios, rates, proportions, and unit conversions on their exams."
    },
    {
        "name": "Linear inequalities in one or two variables",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:algebra-easier/x0fcc98a58ba3bea7:linear-inequality-word-problems-easier/a/v2-sat-lesson-linear-inequality-word-problems"
        ],
        "summary": "**Summary: Solving Linear Inequality Word Problems**\n\n---\n\n### Overview\n\nThis topic focuses on understanding and solving word problems that involve linear inequalities. Unlike equations, inequalities express a range of possible solutions rather than a single value. These problems require translating real-world situations into mathematical inequalities and then solving them to find the set of values that satisfy the conditions.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Understanding Linear Inequalities**  \n   - A linear inequality resembles a linear equation but uses inequality signs such as `<`, `>`, `≤`, or `≥` instead of `=`.\n   - The solution to a linear inequality is a range or interval of values rather than a single number.\n\n2. **Translating Word Problems into Inequalities**  \n   - Identify the variable representing the unknown quantity.\n   - Carefully read the problem to understand the relationship described.\n   - Convert phrases like \"at least,\" \"no more than,\" \"less than,\" or \"greater than\" into the corresponding inequality symbols.\n   - Write an inequality that models the situation.\n\n3. **Solving the Inequality**  \n   - Use algebraic operations (addition, subtraction, multiplication, division) to isolate the variable.\n   - Remember that multiplying or dividing both sides by a negative number reverses the inequality sign.\n   - Express the solution as an inequality or interval.\n\n4. **Interpreting the Solution in Context**  \n   - Translate the mathematical solution back into words.\n   - Check if the solution makes sense in the context of the problem.\n   - Sometimes, solutions must be whole numbers or positive values depending on the scenario.\n\n---\n\n### Actionable Study Tips\n\n- **Practice translating phrases into inequalities**: Focus on common keywords and their corresponding inequality symbols.\n- **Work step-by-step**: Write down what each part of the problem means before forming the inequality.\n- **Pay attention to inequality direction**: Especially when multiplying or dividing by negative numbers.\n- **Check your answers**: Substitute values from your solution set back into the original inequality to verify correctness.\n- **Visualize solutions on a number line**: This helps understand the range of possible values.\n\n---\n\n### Recommended Exercises\n\n- **Basic translation problems**: Convert simple word phrases into inequalities.\n- **Solving inequalities**: Practice isolating variables and solving inequalities algebraically.\n- **Contextual problems**: Solve word problems involving real-life scenarios like budgeting, distance, or quantities.\n- **Graphing solutions**: Plot solution sets on number lines to visualize the range.\n- **Mixed practice**: Combine inequalities with equations to strengthen understanding.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Forgetting to flip the inequality sign** when multiplying or dividing by a negative number.\n- **Misinterpreting key words** such as confusing \"at least\" (≥) with \"more than\" (>) or \"no more than\" (≤).\n- **Ignoring domain restrictions**: Some problems require solutions to be positive or integers.\n- **Not checking solutions in context**: A mathematically correct solution might not make sense in the real-world scenario.\n- **Treating inequalities like equations**: Remember that inequalities represent ranges, not single values.\n\n---\n\nBy mastering these concepts and practicing regularly, students can confidently solve linear inequality word problems and apply these skills in exam settings."
    },
    {
        "name": "Percentages",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:problem-solving-and-data-analysis-easier/x0fcc98a58ba3bea7:percentages-easier/a/v2-sat-lesson-percentages"
        ],
        "summary": "**Summary: Understanding Percentages for Exam Preparation**\n\n---\n\n### Overview\n\nPercentages are a fundamental mathematical concept frequently tested in exams like the SAT. They represent a part of a whole expressed as a fraction of 100. Mastering percentages involves understanding how to convert between percentages, decimals, and fractions, calculate percentage increases or decreases, and solve real-world problems involving discounts, interest, and proportions.\n\n---\n\n### Key Concepts and Techniques\n\n1. **Definition of Percentage**  \n   A percentage is a ratio expressed as a fraction of 100. For example, 25% means 25 out of 100 or 25/100.\n\n2. **Converting Between Forms**  \n   - To convert a percentage to a decimal, divide by 100 (e.g., 45% → 0.45).  \n   - To convert a decimal to a percentage, multiply by 100 (e.g., 0.3 → 30%).  \n   - To convert a fraction to a percentage, divide numerator by denominator and multiply by 100.\n\n3. **Finding the Percentage of a Number**  \n   Multiply the number by the percentage expressed as a decimal.  \n   Example: 20% of 50 = 0.20 × 50 = 10.\n\n4. **Calculating Percentage Increase or Decrease**  \n   - Percentage increase = [(new value − original value) / original value] × 100  \n   - Percentage decrease = [(original value − new value) / original value] × 100\n\n5. **Solving for the Whole or Part**  \n   - If you know the part and the percentage, find the whole by dividing the part by the decimal form of the percentage.  \n   - If you know the whole and the percentage, find the part by multiplying the whole by the decimal percentage.\n\n6. **Real-World Applications**  \n   - Discounts: Calculate the reduced price by subtracting the discount percentage of the original price.  \n   - Markups: Add a percentage to the original price to find the selling price.  \n   - Interest: Use percentages to calculate simple interest or growth over time.\n\n---\n\n### Study Tips\n\n- **Practice converting between decimals, fractions, and percentages** until it becomes second nature.  \n- **Memorize key percentage benchmarks** (e.g., 10%, 25%, 50%, 75%) to estimate quickly.  \n- **Use estimation to check your answers** for reasonableness.  \n- **Work through word problems carefully**, identifying what is given and what is asked.  \n- **Write percentages as decimals early** in calculations to avoid confusion.  \n- **Review percentage increase/decrease formulas** and practice applying them in different contexts.\n\n---\n\n### Recommended Exercises\n\n- Convert various percentages to decimals and fractions and vice versa.  \n- Calculate the percentage of different numbers (e.g., 15% of 80, 60% of 150).  \n- Solve problems involving percentage increase and decrease (e.g., price changes, population growth).  \n- Practice word problems involving discounts, markups, and interest calculations.  \n- Work on problems where you find the whole given a part and a percentage.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Confusing the percentage with the decimal form** (e.g., using 20 instead of 0.20 in calculations).  \n- **Forgetting to convert percentages to decimals before multiplying.**  \n- **Mixing up percentage increase and decrease formulas.**  \n- **Not reading word problems carefully**, leading to incorrect identification of the part, whole, or percentage.  \n- **Ignoring units or context**, which can cause misinterpretation of the problem.\n\n---\n\nBy focusing on these core ideas and practicing a variety of problems, students can build confidence and accuracy in handling percentages, a key skill for many standardized tests and real-life applications."
    },
    {
        "name": "One-variable data: Distributions and measures of center and spread",
        "link": [
            "https://www.khanacademy.org/test-prep/v2-sat-math/x0fcc98a58ba3bea7:problem-solving-and-data-analysis-easier/x0fcc98a58ba3bea7:center-spread-and-shape-of-distributions-easier/a/v2-sat-lesson-center-spread-and-shape-of-distributions"
        ],
        "summary": "**Summary: Understanding Center, Spread, and Shape of Distributions for SAT Math**\n\n---\n\n### Overview\n\nThis topic focuses on interpreting and analyzing data distributions, a key skill tested in the SAT Math section under problem-solving and data analysis. Understanding how data is spread out, where it centers, and the overall shape of the distribution helps in making informed conclusions about data sets. This knowledge is essential for answering questions related to statistics, data interpretation, and probability.\n\n---\n\n### Key Concepts\n\n1. **Center of a Distribution**\n   - The center represents a typical or middle value of the data.\n   - Common measures of center include:\n     - **Mean**: The average of all data points.\n     - **Median**: The middle value when data is ordered.\n   - The median is less affected by extreme values (outliers) than the mean.\n\n2. **Spread of a Distribution**\n   - Spread describes how much the data varies or how dispersed it is.\n   - Key measures of spread include:\n     - **Range**: Difference between the highest and lowest values.\n     - **Interquartile Range (IQR)**: Difference between the 75th percentile (Q3) and 25th percentile (Q1), showing the spread of the middle 50% of data.\n     - **Standard Deviation**: Average distance of data points from the mean (more advanced, but sometimes referenced).\n   - A larger spread indicates more variability in data.\n\n3. **Shape of a Distribution**\n   - The shape describes the overall pattern of the data.\n   - Common shapes include:\n     - **Symmetric**: Data is evenly distributed around the center.\n     - **Skewed Right (Positive Skew)**: Tail extends to the right; mean > median.\n     - **Skewed Left (Negative Skew)**: Tail extends to the left; mean < median.\n     - **Uniform**: Data is evenly spread without clear peaks.\n     - **Bimodal or Multimodal**: Two or more peaks in the data.\n   - Recognizing shape helps in choosing appropriate measures of center and spread.\n\n4. **Outliers**\n   - Outliers are data points that are significantly different from others.\n   - They can affect the mean and the overall interpretation of data.\n   - The median and IQR are more resistant to outliers.\n\n---\n\n### Study Tips\n\n- **Visualize Data**: Practice sketching or interpreting histograms, box plots, and dot plots to understand distribution shape, center, and spread.\n- **Compare Mean and Median**: Use their relationship to identify skewness.\n- **Calculate IQR and Range**: Get comfortable finding quartiles and using them to measure spread.\n- **Identify Outliers**: Learn the 1.5 × IQR rule to detect outliers.\n- **Relate Shape to Real-World Context**: Think about what skewness or spread means in practical scenarios.\n\n---\n\n### Recommended Exercises\n\n- **Interpreting Graphs**: Analyze histograms and box plots to describe center, spread, and shape.\n- **Calculating Measures**: Find mean, median, range, and IQR from given data sets.\n- **Comparing Distributions**: Given two or more data sets, compare their centers, spreads, and shapes.\n- **Outlier Detection**: Identify outliers using the IQR method and discuss their impact.\n- **Skewness Identification**: Determine if a distribution is symmetric or skewed based on mean and median.\n\n---\n\n### Common Mistakes to Avoid\n\n- **Confusing Mean and Median**: Remember that mean is sensitive to outliers, median is not.\n- **Ignoring Shape**: Don’t rely solely on numerical measures; always consider the distribution’s shape.\n- **Misinterpreting Spread**: Range alone can be misleading if outliers are present; use IQR for a better sense of typical spread.\n- **Overlooking Outliers**: Failing to identify outliers can lead to incorrect conclusions about the data.\n- **Assuming Symmetry**: Not all data is symmetric; check skewness before choosing summary statistics.\n\n---\n\nBy mastering these concepts, students will be well-prepared to tackle SAT questions involving data distributions, enabling them to analyze and interpret data effectively under exam conditions."
    }
]