{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context' questions, leverage your natural attention to detail by annotating passages to highlight context clues like synonyms, antonyms, and contrasts. Commit to quick, timed drills where you decide on word meanings confidently, then review your accuracy to build trust in your instincts and reduce second-guessing.",
        "For 'Command of Evidence' questions, practice active reading by underlining key phrases and summarizing answers in your own words before locating evidence. Set strict time limits to answer paired questions, then reflect on your choices to strengthen your ability to quickly identify the strongest textual support without hesitation.",
        "To master 'Form, Structure, and Sense,' create brief outlines of passage organization during practice to track how ideas flow and connect. Challenge yourself to explain the purpose of each paragraph aloud within a set time, reinforcing your analytical skills and boosting confidence in recognizing logical structures under pressure.",
        "When studying 'Nonlinear Functions,' sketch graphs regularly to visualize problem behavior and solidify understanding. Use timed problem sets to practice solving nonlinear equations swiftly, then review errors carefully to avoid overthinking and build confidence in your solution strategies.",
        "For 'Linear Functions' in word problems, develop a habit of translating scenarios into equations within a fixed time frame. Use diagrams or tables to organize information quickly, then check your interpretations against the problem context to ensure accuracy and reduce hesitation in committing to answers.",
        "In solving 'Nonlinear Equations and Systems,' focus on mastering substitution techniques through repetitive, timed exercises. After solving, immediately verify solutions by plugging them back into original equations to build accuracy and trust in your process, minimizing rumination on past mistakes."
    ]
}