{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When working on Words in Context, leverage your natural attention to detail by annotating passages to highlight context clues like synonyms, antonyms, and contrasts. To build confidence, set a timer for quick vocabulary drills where you commit to your first instinct, then review your accuracy to reinforce trust in your analytical judgment.",
        "For Boundaries, practice identifying independent clauses aloud to internalize natural sentence breaks. Use timed sentence correction drills to reduce second-guessing and build fluency in applying punctuation rules, pairing this with positive feedback from peers or mentors to maintain motivation and confidence.",
        "In Form, Structure, and Sense, outline passages briefly to map the logical flow and purpose of each paragraph. Challenge yourself with exercises that require you to choose the best transitions under time constraints, helping you trust your structural analysis and reduce hesitation during the test.",
        "When studying Nonlinear Functions, sketch graphs quickly to visualize problem structure and confirm your solutions. Incorporate timed problem sets where you commit to an answer before verifying, helping you balance thoroughness with speed and build confidence in your problem-solving instincts.",
        "For Linear Functions, translate word problems into equations using diagrams or tables to organize information clearly. Practice committing to your first equation formulation within a set time, then reflect on any errors to strengthen your ability to trust your initial analytical approach under pressure.",
        "With Linear Equations in Two Variables, focus on clearly labeling variables and writing equations step-by-step to avoid confusion. Use paired practice sessions with a mentor or peer to receive encouraging feedback on your solutions, reinforcing your accuracy and reducing rumination on past mistakes."
    ]
}