[
  {
    "title": "Your Learning Persona",
    "description": "Hello Jevinn, as a Persistent Hiker, you approach your SAT preparation with steady determination and a clear focus on maintaining balance. Your calm and thoughtful nature helps you manage stress effectively, allowing for consistent progress without burnout. You naturally prioritize emotional stability and sustainable growth, which supports long-term success. At times, you may lean toward comfort zones, avoiding challenges that feel disruptive, but small, deliberate pushes can help you break through plateaus. Embracing manageable challenges as growth opportunities will align well with your thoughtful approach."
  },
  {
    "title": "Your SAT Practice Snapshot",
    "description": "Your current SAT practice shows a strong performance in Math with a score of 710 and solid accuracy, while Reading & Writing sits at 380 with room for improvement. Your total score is 1090, with a goal of reaching 1550. Your reading accuracy indicates that focusing on comprehension and structure will be key, while your math accuracy reflects solid command with some areas to refine. The effort you’ve put in so far lays a foundation to build on steadily toward your target."
  },
  {
    "title": "What This Means For You",
    "description": "Your Persistent Hiker mindset supports steady progress but may hold you back from pushing into more demanding challenges. Academic Strengths: Your Reading & Writing strength lies in understanding information and ideas, which matches your thoughtful and balanced learning style, while your Math strength in algebra and advanced math reflects your ability to maintain focus and consistency. Growth Areas: Craft and Structure in Reading & Writing and Geometry and Trigonometry in Math are areas to develop, as improving these will deepen your comprehension and problem-solving skills, encouraging you to step beyond comfort zones. Closing Insight: Reaching your goal score will require targeted effort in these specific domains, balanced with your steady approach."
  },
  {
    "title": "Your Study Plan: Based on You",
    "description": [
      {
        "title": "Summary",
        "description": [
          "Your Persistent Hiker mindset favors steady, balanced progress, which is a strong asset for sustained SAT preparation. You have demonstrated solid math skills and thoughtful reading comprehension but tend to avoid intense pressure or discomfort. Addressing this tendency by introducing small, manageable challenges will help you move past plateaus without disrupting your inner balance."
        ]
      },
      {
        "title": "Reading Writing Strategies",
        "description": [
          "1. Focus on Craft and Structure by breaking down sentence and paragraph relationships in short, reflective sessions that respect your preference for calm study environments.",
          "2. Reinforce Information and Ideas by summarizing passages aloud or in writing to build confidence through active engagement with content you already understand well.",
          "3. Maintain momentum in Expression of Ideas by gamifying practice with timed quizzes or level-based exercises that reward steady progress and keep motivation aligned with your growth style."
        ]
      },
      {
        "title": "Math Strategies",
        "description": [
          "1. Concentrate on Geometry and Trigonometry through visual problem-solving exercises that allow you to explore concepts at your own pace, reducing pressure while encouraging incremental challenge.",
          "2. Refine Problem-Solving and Data Analysis skills by working on real-world scenarios that connect to your logical thinking and steady approach, reinforcing partial strengths.",
          "3. Sustain confidence in Algebra and Advanced Math by incorporating step-by-step review sessions that align with your preference for deliberate, consistent learning."
        ]
      },
      {
        "title": "Study Plan Phases",
        "description": {
          "Foundation": {
            "date": "May 26, 2025 - July 10, 2025",
            "reading_writing": "Prioritize Craft and Structure with calm, reflective exercises that build foundational understanding without overwhelming pressure.",
            "math": "Focus on Geometry and Trigonometry using visual and paced problem-solving to gently expand your skill set."
          },
          "Elevation": {
            "date": "July 11, 2025 - August 1, 2025",
            "reading_writing": "Target Information and Ideas with active summarization and timed drills to sharpen comprehension and fluency.",
            "math": "Work on Problem-Solving and Data Analysis through applied practice that builds on your existing strengths and encourages steady growth."
          },
          "Peak": {
            "date": "August 2, 2025 - August 8, 2025",
            "reading_writing": "Focus on timed full-section simulations emphasizing fluency and error correction in all Reading & Writing domains.",
            "math": "Sharpen speed and accuracy in all Math domains with personalized timed practice and review of common pitfalls."
          }
        }
      },
      {
        "title": "Sample Weekly Schedule",
        "description": [
          "Monday: focus area: Craft and Structure - duration 60 minutes.",
          "Tuesday: focus area: Geometry and Trigonometry - duration 60 minutes.",
          "Wednesday: focus area: Information and Ideas - duration 60 minutes.",
          "Thursday: focus area: Problem-Solving and Data Analysis - duration 60 minutes.",
          "Friday: focus area: Expression of Ideas - duration 60 minutes.",
          "Saturday: focus area: Mixed-subject drill with timed practice - duration 60 minutes.",
          "Sunday: focus area: Flex day for review or rest - duration 30 minutes."
        ]
      },
      {
        "title": "Study Tips",
        "description": [
          "1. Let’s build skill in Craft and Structure by breaking down sentence relationships in short, focused sessions that fit your calm study style.",
          "2. Try focusing on Geometry and Trigonometry with visual exercises that allow you to explore concepts without pressure.",
          "3. You can boost confidence in Information and Ideas by summarizing passages aloud to deepen understanding.",
          "4. Establish a steady weekly routine that balances focused study with breaks, aligning with your preference for sustainable progress as the test date approaches.",
          "5. Recognize that small, deliberate challenges are key to growth; pacing yourself while stepping slightly beyond comfort will create meaningful gains."
        ]
      }
    ]
  },
  {
    "title": "Want to Go Further?",
    "description": "Jevinn, your steady approach and thoughtful mindset provide a strong foundation for meaningful SAT progress. Embracing targeted challenges in specific domains will help you move beyond comfort zones without disrupting your balance. Sherpal offers personalized insights and adaptive coaching designed to support your unique learning style and guide you through each step toward your goal."
  },
  {
    "title": "Footer",
    "description": "Safe harbor The scores, assessments, and recommendations provided in this report are for informational purposes only and do not constitute professional educational, psychological, or legal advice. Current performance is not necessarily indicative of actual or future results, as test-day conditions and individual circumstances may vary. While care has been taken in the preparation of this material, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, or reliability of the information presented. Any reliance you place on such information is strictly at your own risk. We accept no liability for any loss or damage arising from the use of this report. © 2025 Sthirah Inc. | Confidential & Proprietary - For internal Use Only"
  }
]