{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context' questions, focus on annotating key context clues such as definitions, contrasts, and examples directly in the passage. Practice paraphrasing challenging sentences aloud or in writing to deepen your conceptual understanding and build confidence in trusting your interpretation under timed conditions.",
        "Develop a habit of briefly outlining the form and structure of each passage before answering questions. This will help you anticipate the author’s intent and improve your ability to quickly identify logical flow and transitions, reducing hesitation and overanalysis during the test.",
        "Use graphic organizers or charts to map out relationships between multiple sources when practicing rhetorical synthesis. After each practice session, journal moments when your synthesis instincts were correct to reinforce confidence and remind yourself that moving forward with partial information is a strength, not a risk.",
        "For nonlinear functions, consistently sketch graphs before solving problems to visualize behavior and key features. Set a timer for practice problems to encourage quicker decision-making, and review your solutions afterward to confirm when your initial instincts about function behavior were accurate.",
        "When working on systems of linear equations word problems, practice translating word problems into equations under timed conditions to build fluency. Use step-by-step notation to keep your work organized and reduce errors, and reflect after each practice on how well you balanced accuracy with speed.",
        "In isolating quantities, break down each equation manipulation into clear, deliberate steps and write them out fully to avoid skipping or rushing. Incorporate timed drills where you isolate variables quickly but accurately, then review mistakes to build trust in your ability to make confident, efficient decisions during the test."
    ]
}