{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context' questions, focus on annotating key context clues—such as contrasts or restatements—quickly to avoid overanalyzing. Practice timed drills where you identify word meanings using only the passage context, then review your instincts afterward to build confidence in your initial interpretations.",
        "Develop a habit of outlining the form and structure of passages during practice to anticipate the author's intent and logical flow. Use brief notes to track paragraph purposes and transitions, which will help you make faster, more confident decisions under time pressure without sacrificing depth of understanding.",
        "In rhetorical synthesis exercises, practice integrating ideas from multiple sources by summarizing and connecting them in your own words. After each practice, journal moments when your synthesis felt clear and accurate to reinforce trust in your analytical instincts and reduce hesitation during timed writing tasks.",
        "For nonlinear functions, consistently sketch graphs before solving problems to visualize behavior and reduce second-guessing. Incorporate timed practice sets where you identify function types and key features rapidly, helping you balance deep understanding with quicker decision-making.",
        "When working on systems of linear equations word problems, create clear variable labels and write out each step methodically to avoid errors. Use short timed drills to translate word problems into equations quickly, then review solutions to confirm your accuracy and build confidence in committing to answers.",
        "Practice isolating variables in algebraic expressions step-by-step, writing each manipulation clearly to prevent confusion. Set a timer for each problem to encourage steady pacing, and after solving, reflect on how trusting your process—even if imperfect—helps maintain momentum during the test."
    ]
}