{
    "title": "Peak Phase",
    "description": [
        {
            "title": "Weekly Goals",
            "description": "Each week, steadily increase accuracy and reasoning in both Math and Reading & Writing by reducing repeat mistakes and improving response time under pressure. Aim to solidify mastery of complex inference and evidence-based questions in Reading & Writing while sharpening problem-solving speed and precision in key Math areas like area, volume, and linear relationships. Maintain emotional control to minimize score variance and lock in a consistent, confident test-taking strategy."
        },
        {
            "title": "Skill Areas",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": "Inferences, Command of Evidence - Textual, Command of Evidence - Quantitative, Central Ideas and Details, Cross-text Connections"
                },
                {
                    "title": "Math",
                    "description": "Area and volume, Linear functions, Linear inequalities in one or two variables, Ratios, rates, proportional relationships, and units"
                }
            ]
        },
        {
            "title": "Practice Methods",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": {
                        "Inferences": "Practice timed sets of challenging inference questions using SAT passages, annotating clues and tone while racing against a visible countdown timer to beat your previous completion time, reinforcing calm urgency and deep textual analysis.",
                        "Command of Evidence - Textual": "Work on paired question sets under strict time limits, first answering the main question then immediately locating and justifying the supporting evidence, using a stopwatch to track and improve speed without sacrificing accuracy.",
                        "Command of Evidence - Quantitative": "Engage in timed drills interpreting graphs and tables embedded in passages, paraphrasing data aloud before selecting evidence, with a goal to progressively reduce time per question while maintaining precision.",
                        "Central Ideas and Details": "Complete advanced-level passages focusing on identifying central ideas and supporting details, using annotation and summarization techniques under timed conditions to build speed and accuracy simultaneously.",
                        "Cross-text Connections": "Practice paired passage comparisons with a focus on author purpose and tone, using graphic organizers to map relationships, all within a set time frame to cultivate quick synthesis and confident decision-making."
                    }
                },
                {
                    "title": "Math",
                    "description": {
                        "Area and volume": "Solve progressively harder area and volume problems under timed conditions, using a visible countdown to push pace while carefully checking units and formulas to avoid errors, aiming to beat your best time each session.",
                        "Linear functions": "Translate complex word problems into linear equations and solve them within strict time limits, using step-by-step annotation to maintain clarity and calm focus under pressure.",
                        "Linear inequalities in one or two variables": "Practice solving challenging inequality word problems with a timer, emphasizing careful sign management and solution verification, while striving to improve speed without losing accuracy.",
                        "Ratios, rates, proportional relationships, and units": "Complete multi-step ratio and proportion problems involving unit conversions under timed drills, tracking progress with a stopwatch to build urgency and mastery simultaneously."
                    }
                }
            ]
        },
        {
            "title": "Weekly Structure",
            "description": "Each weekday focuses on dual-skill practice pairing one Math and one Reading & Writing skill, starting Monday and Tuesday with the weakest skills to build urgency and momentum, midweek targeting moderate skills to maintain steady progress, and Friday dedicated to comprehensive review and error analysis. Saturdays feature two full-length, timed practice tests simulating real conditions to build endurance and confidence, followed by detailed review sessions to identify patterns and refine strategies. Sunday serves as a Flex Day to recharge and adapt."
        },
        {
            "title": "Flex Day Activities",
            "description": "Engage in low-pressure reflection by reviewing errors from the week to identify subtle patterns without judgment, experiment with new study tools or timing apps to enhance focus, and attempt mixed-skill challenge sets at a relaxed pace to maintain cognitive flexibility. Incorporate mindfulness or light physical activity to reset mental energy, and set clear, motivating goals for the upcoming week to sustain momentum while honoring your calm, steady nature."
        }
    ]
}