{
    "title": "Foundation Phase",
    "description": [
        {
            "title": "Weekly Goals",
            "description": "Achieve measurable improvements in accuracy and reasoning across prioritized Reading & Writing and Math skills, steadily reduce repeat mistakes by identifying patterns, and build a disciplined study habit that fosters consistent progress. Strengthen comprehension of core concepts in nonlinear functions and form, structure, and sense while beginning to close gaps in command of evidence and systems of equations. Cultivate confidence through steady, focused practice that balances challenge with calm."
        },
        {
            "title": "Skill Areas",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": [
                        "Form, Structure, and Sense",
                        "Words in Context",
                        "Text Structure and Purpose",
                        "Command of Evidence - Textual"
                    ]
                },
                {
                    "title": "Math",
                    "description": [
                        "Nonlinear functions",
                        "Linear equations in two variables",
                        "Systems of two linear equations in two variables",
                        "Nonlinear equations in one variable and systems of equations in two variables",
                        "Percentages"
                    ]
                }
            ]
        },
        {
            "title": "Practice Methods",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": {
                        "Form, Structure, and Sense": [
                            "Practice identifying the form and internal structure of passages by outlining paragraphs with labels such as introduction, evidence, and conclusion, then complete timed reordering exercises where sentences or paragraphs are rearranged to improve logical flow, using a visible countdown to maintain focus and urgency.",
                            "Engage in transition word fill-in-the-blank drills that require selecting the most effective connectors to enhance coherence, timed to encourage steady pacing and subtle competition against previous attempts.",
                            "Answer purpose-driven questions that ask why specific paragraphs or sentences are placed where they are, followed by brief written summaries explaining how the structure supports the main idea, reinforcing clarity and critical analysis."
                        ],
                        "Words in Context": [
                            "Work through medium-difficulty vocabulary-in-context questions drawn from diverse passages, annotating challenging words and their surrounding clues, then paraphrase sentences aloud or in writing to deepen understanding, all within a set time limit to build internal urgency.",
                            "Complete sentence completion exercises where the best-fitting word is chosen based on context clues, tracking accuracy and aiming to beat previous completion times to maintain intensity without sacrificing calm.",
                            "Practice reading comprehension drills focusing on passages with complex vocabulary, annotating tone and connotation, then use process of elimination to select answers, reinforcing thoughtful, composed decision-making under subtle time pressure."
                        ],
                        "Text Structure and Purpose": [
                            "Identify text structure types by reading short passages and labeling them (e.g., cause-effect, problem-solution), then write concise statements of author purpose, using a timer to encourage steady focus and a 'beat your best time' approach.",
                            "Highlight signal words in passages and explain their role in structure aloud or in writing, practicing this under timed conditions to build speed and accuracy while maintaining composure.",
                            "Create outlines of passages to visualize organization and answer multiple-choice questions on structure and purpose, progressively increasing difficulty to stretch skills without overwhelming calmness."
                        ],
                        "Command of Evidence - Textual": [
                            "Practice paired question sets where the first question requires an answer and the second demands identification of supporting evidence, annotating passages actively and timing each set to foster urgency and internal competition.",
                            "Engage in text annotation exercises marking main ideas and supporting details, then summarize paragraphs in your own words to reinforce understanding and prepare for evidence matching tasks, all within a controlled time frame.",
                            "Complete evidence matching drills where multiple possible supports are identified and the strongest is selected, using a visible countdown to maintain focus and encourage incremental improvement."
                        ]
                    }
                },
                {
                    "title": "Math",
                    "description": {
                        "Nonlinear functions": [
                            "Sketch graphs of quadratic and exponential functions from given equations, then solve related quadratic equations using factoring and the quadratic formula, timing each problem set to build urgency while preserving calm focus.",
                            "Classify functions as linear or nonlinear based on equations and graphs, explaining key features aloud or in writing, with a countdown timer to encourage steady pacing and subtle competition against previous attempts.",
                            "Translate real-world scenarios into nonlinear equations and solve them, progressively increasing problem difficulty and using 'beat your best time' challenges to stretch skills without disrupting composure."
                        ],
                        "Linear equations in two variables": [
                            "Translate word problems into two linear equations by identifying variables and relationships, then solve using substitution or elimination methods, timing each step to build internal urgency and maintain steady focus.",
                            "Practice solving systems with substitution and elimination on progressively complex problems, verifying solutions by substitution, and tracking time to encourage subtle competition and consistent intensity.",
                            "Work on real-world scenario problems involving mixtures, rates, and ages, carefully labeling variables and double-checking equations, using visible countdowns to balance pressure with calm problem-solving."
                        ],
                        "Systems of two linear equations in two variables": [
                            "Solve systems using substitution and elimination methods on increasingly challenging problems, writing each step clearly and timing solutions to foster urgency without sacrificing accuracy.",
                            "Graph systems to visualize solutions and identify types (one solution, none, infinite), then confirm algebraic answers, using timed practice to build speed and confidence.",
                            "Translate complex word problems into systems of equations and solve them, verifying solutions in both equations, with a focus on steady pacing and incremental time improvements."
                        ],
                        "Nonlinear equations in one variable and systems of equations in two variables": [
                            "Solve systems combining linear and quadratic equations by substitution, carefully isolating variables and applying the quadratic formula, timing each problem to build urgency while maintaining composure.",
                            "Practice interpreting discriminants to determine the number of solutions, then graph systems to confirm algebraic results, using visible countdowns to encourage steady focus and subtle competition.",
                            "Work on word problems modeling real-world scenarios with linear and quadratic systems, progressively increasing difficulty and timing completion to stretch skills without overwhelming calm."
                        ],
                        "Percentages": [
                            "Perform basic conversion drills between percentages, decimals, and fractions under timed conditions to build fluency and internal urgency while preserving accuracy.",
                            "Calculate specific percentages of numbers and solve percentage increase/decrease problems, writing out each step carefully and timing practice sets to encourage steady focus and subtle competition.",
                            "Solve word problems involving discounts, tax, and interest, breaking down complex questions into clear steps, using visible countdowns to maintain intensity and reinforce disciplined problem-solving."
                        ]
                    }
                }
            ]
        },
        {
            "title": "Weekly Structure",
            "description": "Each weekday includes focused dual-skill practice pairing one Math and one Reading & Writing skill, starting Monday with the weakest skills to address foundational gaps, midweek focusing on moderate skills to build momentum, and Friday dedicated to comprehensive review and error analysis. Saturday concentrates on reinforcing fundamental concepts through targeted skill-building and conceptual exercises, emphasizing accuracy and clarity. Sunday serves as a Flex Day for rest, reflection, and adaptive practice aligned with your steady, composed learning style."
        },
        {
            "title": "Flex Day Activities",
            "description": "Engage in low-pressure reflection by reviewing errors from the week, identifying patterns calmly without judgment. Experiment with new study tools or techniques such as digital annotation apps or timed quizzes to subtly raise internal urgency. Tackle mixed-skill challenges combining Math and Reading & Writing to maintain cognitive flexibility. Incorporate mindfulness or light physical activity to refresh focus and reduce stress. Set clear, achievable goals for the upcoming week, reinforcing your quiet confidence and steady growth mindset."
        }
    ]
}