[
  {
    "title": "Your Learning Persona",
    "description": "Hello Zoha, as a Balanced Trekker, you approach learning with thoughtful reflection and a strong desire to understand the reasoning behind concepts. Your steady mindset and internal motivation allow you to absorb complex ideas deeply, making you well-suited for subjects that require conceptual clarity. At times, your careful nature may lead to hesitation or overanalysis, especially under timed conditions, which can slow your progress. To move forward effectively, focus on building confidence in decision-making and practice trusting your instincts during timed exercises."
  },
  {
    "title": "Your SAT Practice Snapshot",
    "description": "Your current SAT practice shows a solid foundation with a Reading & Writing score of 630 and a Math score of 710, combining for a total of 1340. Your reading accuracy indicates room for improvement, while your math accuracy reflects stronger command. With your goal set at 1550, your efforts so far demonstrate promise, and targeted focus can help bridge the gap toward your target."
  },
  {
    "title": "What This Means For You",
    "description": "Your Balanced Trekker mindset supports deep understanding but can slow decision-making under pressure, which aligns with your challenge of hesitation in timed settings. Academically, your strength in Standard English Conventions and Advanced Math reflects your ability to grasp core concepts thoroughly, matching your reflective learning style. Growth areas include Craft and Structure in Reading & Writing and Geometry and Trigonometry in Math; improving these will enhance your ability to make quicker, confident choices on nuanced problems. Your goal score requires focused development in these domains while maintaining your conceptual strengths."
  },
  {
    "title": "Your Study Plan: Based on You",
    "description": [
      {
        "title": "Summary",
        "description": [
          "Your Balanced Trekker profile means you learn best through understanding and reflection, which supports your strong grasp of complex math and language rules. The challenge lies in managing time and decisiveness during the test, where overanalysis can slow you down. Aligning your study approach with your thoughtful pace while introducing timed decision drills will help you progress steadily toward your goal."
        ]
      },
      {
        "title": "Reading Writing Strategies",
        "description": [
          "1. Focus on Craft and Structure by practicing timed passages that require identifying relationships between ideas, helping you balance depth with speed.",
          "2. Strengthen Information and Ideas by summarizing key points after reading, which leverages your reflective nature and builds confidence in comprehension.",
          "3. Maintain your excellence in Standard English Conventions by reviewing grammar rules through brief, focused exercises that reinforce your existing strengths."
        ]
      },
      {
        "title": "Math Strategies",
        "description": [
          "1. Target Geometry and Trigonometry with visual problem-solving drills under timed conditions to reduce hesitation and improve quick recognition of concepts.",
          "2. Refine Algebra skills by working through multi-step problems that connect ideas, supporting your preference for understanding the 'why' behind methods.",
          "3. Sustain your strength in Advanced Math by engaging in step-by-step reasoning exercises that reinforce your confidence and accuracy."
        ]
      },
      {
        "title": "Study Plan Phases",
        "description": {
          "Foundation": {
            "date": "May 26, 2025 - June 30, 2025",
            "reading_writing": "Prioritize Craft and Structure with focused timed drills to build decision speed while maintaining comprehension depth.",
            "math": "Concentrate on Geometry and Trigonometry fundamentals using visual aids and stepwise problem-solving to address hesitation."
          },
          "Elevation": {
            "date": "July 1, 2025 - July 31, 2025",
            "reading_writing": "Develop Information and Ideas through reflective summarization and timed practice to enhance fluency and confidence.",
            "math": "Refine Algebra skills with complex problem sets that encourage conceptual connections and reinforce accuracy."
          },
          "Peak": {
            "date": "August 1, 2025 - August 8, 2025",
            "reading_writing": "Focus on timed full-section simulations emphasizing pacing and error analysis in weaker domains.",
            "math": "Sharpen speed and accuracy in all domains with personalized timed drills and review of common pitfalls."
          }
        }
      },
      {
        "title": "Sample Weekly Schedule",
        "description": [
          "Monday: focus area: Craft and Structure - duration 60 minutes.",
          "Tuesday: focus area: Geometry and Trigonometry - duration 60 minutes.",
          "Wednesday: focus area: Information and Ideas - duration 60 minutes.",
          "Thursday: focus area: Algebra - duration 60 minutes.",
          "Friday: focus area: Expression of Ideas - duration 60 minutes.",
          "Saturday: focus area: Mixed timed practice (Reading & Writing and Math) - duration 60 minutes.",
          "Sunday: focus area: Flex day for review or rest - duration 30 minutes."
        ]
      },
      {
        "title": "Study Tips",
        "description": [
          "1. Let’s build skill in Craft and Structure by practicing timed questions that require quick identification of relationships between ideas, helping you balance thoroughness with speed.",
          "2. Try focusing on Geometry and Trigonometry through visual problem-solving exercises that encourage faster recognition and reduce hesitation.",
          "3. You can boost confidence in Algebra by connecting concepts through multi-step problems that align with your reflective learning style.",
          "4. Establish a consistent weekly routine that balances deep concept review with timed drills, allowing you to manage pacing without sacrificing understanding.",
          "5. Recognize moments when your instincts guide you correctly during practice and journal these to reinforce trust in your decision-making under pressure."
        ]
      }
    ]
  },
  {
    "title": "Want to Go Further?",
    "description": "Zoha, your thoughtful approach and steady grasp of complex concepts position you well for growth. Addressing your pacing and decisiveness will be key to reaching your target score. Sherpal offers tailored insights and adaptive coaching designed to support your reflective style while sharpening your test-day execution."
  },
  {
    "title": "Footer",
    "description": "Safe harbor The scores, assessments, and recommendations provided in this report are for informational purposes only and do not constitute professional educational, psychological, or legal advice. Current performance is not necessarily indicative of actual or future results, as test-day conditions and individual circumstances may vary. While care has been taken in the preparation of this material, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, or reliability of the information presented. Any reliance you place on such information is strictly at your own risk. We accept no liability for any loss or damage arising from the use of this report. © 2025 Sthirah Inc. | Confidential & Proprietary - For internal Use Only"
  }
]