{
    "title": "Peak Phase",
    "description": [
        {
            "title": "Weekly Goals",
            "description": "Achieve consistent accuracy above 90% in prioritized Math and Reading & Writing skills while reducing repeat errors by at least 50%. Strengthen reasoning speed to confidently commit to answers within timed conditions. Stabilize performance across full-length practice tests to minimize score variance. Build mental endurance to sustain focus and composure throughout test duration, reinforcing trust in your analytical instincts."
        },
        {
            "title": "Skill Areas",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": [
                        "Command of Evidence - Textual",
                        "Command of Evidence - Quantitative",
                        "Central Ideas and Details",
                        "Rhetorical Synthesis",
                        "Cross-text Connections"
                    ]
                },
                {
                    "title": "Math",
                    "description": [
                        "Percentages",
                        "Ratios, rates, proportional relationships, and units",
                        "Right triangles and trigonometry",
                        "One-variable data: Distributions and measures of center and spread"
                    ]
                }
            ]
        },
        {
            "title": "Practice Methods",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": {
                        "Command of Evidence - Textual": "Practice paired question sets under timed conditions where you first answer the main question, then immediately select the strongest supporting evidence from the passage, annotating key phrases to reinforce direct textual connections and build speed with accuracy.",
                        "Command of Evidence - Quantitative": "Engage in timed drills interpreting embedded graphs and tables, highlighting key data points, then quickly identifying which numerical evidence best supports given claims, followed by immediate self-checks to build confidence in data-driven reasoning.",
                        "Central Ideas and Details": "Summarize short passages aloud within a strict time limit, focusing on articulating the central idea and listing supporting details, then compare with model answers to refine precision and reduce hesitation.",
                        "Rhetorical Synthesis": "Analyze paired passages by creating quick comparison charts that identify agreements, contrasts, and rhetorical appeals, then write brief synthesis paragraphs under timed conditions to strengthen integration skills and decisiveness.",
                        "Cross-text Connections": "Complete practice sets comparing two related texts by annotating author purpose, tone, and evidence, then answer synthesis questions within a set time to enhance pattern recognition and trust in your interpretive judgments."
                    }
                },
                {
                    "title": "Math",
                    "description": {
                        "Percentages": "Perform rapid-fire conversion drills between fractions, decimals, and percentages with immediate feedback, then solve multi-step word problems involving percentage increase/decrease under timed conditions to reinforce accuracy and speed.",
                        "Ratios, rates, proportional relationships, and units": "Work through complex proportion and unit conversion problems in timed sets, explicitly writing out unit cancellations and cross-multiplication steps to solidify procedural fluency and reduce second-guessing.",
                        "Right triangles and trigonometry": "Solve a series of right triangle problems requiring identification of sides relative to angles and application of sine, cosine, and tangent ratios under timed conditions, followed by quick error analysis to build confidence in trigonometric reasoning.",
                        "One-variable data: Distributions and measures of center and spread": "Interpret diverse data sets by calculating mean, median, range, and IQR within strict time limits, then analyze box plots and histograms to identify distribution shape and outliers, reinforcing pattern recognition and decision-making speed."
                    }
                }
            ]
        },
        {
            "title": "Weekly Structure",
            "description": "Each weekday focuses on dual-skill practice pairing one Math and one Reading & Writing skill, starting Monday and Tuesday with your weakest areas to maximize early-week gains. Wednesday and Thursday target moderate skills to maintain momentum. Friday is dedicated to comprehensive review of errors and strategy refinement. Saturday features two full-length practice tests simulating real exam conditions, emphasizing accuracy and pacing, followed by detailed mistake analysis to identify patterns and reinforce confidence. Sunday serves as a Flex Day for rest and adaptive activities."
        },
        {
            "title": "Flex Day Activities",
            "description": "Engage in reflective journaling on recent errors to identify thought patterns without judgment, fostering emotional balance. Experiment with new problem-solving tools or timing techniques in low-pressure settings to enhance cognitive flexibility. Challenge yourself with mixed-skill puzzles that reward pattern recognition and logical reasoning, aligning with your explorer mindset. Incorporate mindfulness or light physical activity to reset focus and reduce mental fatigue. Set clear, achievable goals for the upcoming week to maintain motivation and self-trust."
        }
    ]
}