{
    "title": "TIPS TO MAKE IT WORK BEST FOR YOUR FOUNDATION PHASE",
    "description": [
        "When tackling 'Words in Context' questions, leverage your natural attention to detail by annotating key context clues—such as synonyms, antonyms, and contrast words—directly on the passage. To build confidence and reduce second-guessing, practice quick timed drills where you commit to an answer and then immediately review your reasoning to reinforce trust in your instincts.",
        "For mastering 'Boundaries' in Writing and Language, focus on identifying independent clauses and practice rewriting sentences aloud to hear natural pauses. Use timed exercises to decide on punctuation quickly, pairing this with positive feedback from peers or mentors to help you overcome hesitation and build confidence in your choices.",
        "Enhance your understanding of 'Form, Structure, and Sense' by outlining passages briefly during practice to track paragraph purposes and transitions. Challenge yourself to explain the author’s intent aloud within a set time, which will help you trust your analytical skills and reduce rumination on past mistakes.",
        "When working on 'Nonlinear Functions,' visualize graphs before solving problems to connect abstract equations with their shapes. Use timed problem sets to practice committing to solutions confidently, then review errors constructively to build accuracy without overthinking.",
        "For 'Linear Functions' word problems, create quick diagrams or tables to organize information and clarify relationships. Incorporate timed drills where you write and solve equations under pressure, followed by reflection on your accuracy to strengthen decision-making speed and self-trust.",
        "In solving 'Linear Equations in Two Variables,' systematically label variables and write equations step-by-step to avoid errors. Practice solving systems within strict time limits, then review solutions with a mentor or peer to receive encouraging feedback that reinforces your growing mastery and confidence."
    ]
}