{
    "title": "Elevation Phase",
    "description": [
        {
            "title": "Weekly Goals",
            "description": "Achieve measurable improvement in accuracy and speed on prioritized Math and Reading & Writing skills by reducing careless errors and hesitation. Strengthen reasoning under moderate time pressure with consistent commitment to answers. Build confidence through tracking streaks of correct responses and reflecting on progress. Maintain steady progress toward the 1590 goal by mastering second-tier skills and improving cognitive flexibility in problem-solving."
        },
        {
            "title": "Skill Areas",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": "Transitions, Boundaries, Rhetorical Synthesis"
                },
                {
                    "title": "Math",
                    "description": "Systems of two linear equations in two variables, Right triangles and trigonometry, Linear equations in one variable, Ratios, rates, proportional relationships, and units, Equivalent expressions"
                }
            ]
        },
        {
            "title": "Practice Methods",
            "description": [
                {
                    "title": "Reading & Writing",
                    "description": {
                        "Transitions": "Engage in timed drills where you identify and select the most effective transition in complex passages, committing to your choice within 30 seconds per question, then review accuracy to build trust in your instincts and reduce second-guessing.",
                        "Boundaries": "Practice sets of challenging boundary questions under timed conditions, focusing on mastering difficult types while tracking streaks of correct answers to reinforce confidence and speed without sacrificing accuracy.",
                        "Rhetorical Synthesis": "Complete advanced synthesis questions in timed blocks, committing to answers quickly and then analyzing errors with a mentor or peer to gain positive feedback and deepen understanding of rhetorical structures."
                    }
                },
                {
                    "title": "Math",
                    "description": {
                        "Systems of two linear equations in two variables": "Solve mixed-method system problems (substitution and elimination) under a 2-minute time limit per question, writing each step clearly to avoid careless errors, then verify solutions and reflect on accuracy to build confidence in committing to answers.",
                        "Right triangles and trigonometry": "Work through complex right triangle problems involving inverse trig functions and real-world applications with timed practice, drawing diagrams for clarity and checking answers for reasonableness to strengthen precision and speed.",
                        "Linear equations in one variable": "Master multi-step linear equations and inequalities by solving under timed conditions, focusing on stepwise isolation and immediate verification of solutions to reduce hesitation and build trust in your process.",
                        "Ratios, rates, proportional relationships, and units": "Practice multi-step ratio and unit conversion problems with strict time limits, writing out units to avoid mistakes and committing to answers before reviewing errors to reinforce accuracy and decisiveness.",
                        "Equivalent expressions": "Engage in timed exercises isolating variables in complex formulas, performing one algebraic operation at a time with clear notation, then substitute back to verify correctness and build confidence in algebraic manipulation."
                    }
                }
            ]
        },
        {
            "title": "Weekly Structure",
            "description": "Each weekday balances focused dual-skill practice pairing one Math and one Reading & Writing skill, starting Monday with the weakest skills to prioritize improvement, midweek focusing on moderate skills to build momentum, and Friday dedicated to comprehensive review and error analysis. Saturday features one full-length timed practice test followed by a detailed review session emphasizing understanding mistakes and reinforcing confidence. Sunday serves as a Flex Day to rest, reflect, and adapt the plan as needed."
        },
        {
            "title": "Flex Day Activities",
            "description": "Engage in low-pressure mixed-skill challenges that encourage exploration without time constraints, allowing you to experiment with new problem-solving techniques or tools. Reflect on past errors by journaling progress and identifying patterns to break cycles of rumination. Incorporate mindfulness or light physical activity to reset focus and reduce stress. Connect with a mentor or peer for positive feedback and encouragement. Set clear, achievable goals for the upcoming week to maintain motivation and self-trust."
        }
    ]
}